[NoCoverage] BooleanLiteral
meal/domain/entities/Meal.ts:14:18
 
   image?: Image;
 
-  isOnShowcase = false;
+  isOnShowcase = true;
 
   assignedStore!: Store;

[NoCoverage] BlockStatement
meal/domain/entities/Meal.ts:18:36
 
   assignedStore!: Store;
 
-  constructor(data: Partial<Meal>) {
-    Object.assign(this, data);
-
-    this.validateMeal();
-  }
+  constructor(data: Partial<Meal>) {}
 
   validateMeal(): void {

[NoCoverage] BlockStatement
meal/domain/entities/Meal.ts:24:24
     this.validateMeal();
   }
 
-  validateMeal(): void {
-    const nameMaxLength = MealConstants.NAME_MAX_LENGTH;
-    const minimumPrice = MealConstants.MINIMUM_PRICE;
-
-    if (!(this.name && this.price && this.assignedStore)) {
-      throw new Error('Meal values must not be null!');
-    }
-
-    if (this.name.length > nameMaxLength) {
-      throw new Error(`Name must be less than ${nameMaxLength} characters!`);
-    }
-
-    if (this.price < minimumPrice) {
-      throw new Error(`Price must be greater than ${minimumPrice}!`);
-    }
-  }
+  validateMeal(): void {}
 }
 

[NoCoverage] LogicalOperator
meal/domain/entities/Meal.ts:28:11
     const nameMaxLength = MealConstants.NAME_MAX_LENGTH;
     const minimumPrice = MealConstants.MINIMUM_PRICE;
 
-    if (!(this.name && this.price && this.assignedStore)) {
+    if (!(this.name && this.price || this.assignedStore)) {
       throw new Error('Meal values must not be null!');
     }

[NoCoverage] LogicalOperator
meal/domain/entities/Meal.ts:28:11
     const nameMaxLength = MealConstants.NAME_MAX_LENGTH;
     const minimumPrice = MealConstants.MINIMUM_PRICE;
 
-    if (!(this.name && this.price && this.assignedStore)) {
+    if (!(this.name || this.price && this.assignedStore)) {
       throw new Error('Meal values must not be null!');
     }

[NoCoverage] ConditionalExpression
meal/domain/entities/Meal.ts:32:9
       throw new Error('Meal values must not be null!');
     }
 
-    if (this.name.length > nameMaxLength) {
+    if (true) {
       throw new Error(`Name must be less than ${nameMaxLength} characters!`);
     }

[NoCoverage] ConditionalExpression
meal/domain/entities/Meal.ts:32:9
       throw new Error('Meal values must not be null!');
     }
 
-    if (this.name.length > nameMaxLength) {
+    if (false) {
       throw new Error(`Name must be less than ${nameMaxLength} characters!`);
     }

[NoCoverage] ConditionalExpression
meal/domain/entities/Meal.ts:36:9
       throw new Error(`Name must be less than ${nameMaxLength} characters!`);
     }
 
-    if (this.price < minimumPrice) {
+    if (true) {
       throw new Error(`Price must be greater than ${minimumPrice}!`);
     }

[NoCoverage] EqualityOperator
meal/domain/entities/Meal.ts:36:9
       throw new Error(`Name must be less than ${nameMaxLength} characters!`);
     }
 
-    if (this.price < minimumPrice) {
+    if (this.price >= minimumPrice) {
       throw new Error(`Price must be greater than ${minimumPrice}!`);
     }
