[Killed] BlockStatement
owner/data/services/DisableOwnerService.ts:27:65
     private readonly ownerWriteRepository: OwnerWriteRepository
   ) {}
 
-  async disable({ id }: InputDisableOwnerDTO): Promise<boolean> {
-    if (!id) {
-      throw new InvalidParameterException('id');
-    }
-
-    const owner = await this.ownerReadRepository.findByID(id);
-
-    if (!owner) {
-      throw new IDDoesNotExistException();
-    }
-
-    await this.ownerWriteRepository.disable({ id });
-
-    return this.ownerReadRepository.disable({ id });
-  }
+  async disable({ id }: InputDisableOwnerDTO): Promise<boolean> {}
 }
 
killedBy: DisableOwnerService Success Cases should be possible to disable an Owner with an valid ID
statusReason: Error: expect(received).toBeTruthy()

Received: undefined
