[Killed] BlockStatement
owner/data/services/EnableOwnerService.ts:27:63
     private readonly ownerWriteRepository: OwnerWriteRepository
   ) {}
 
-  async enable({ id }: InputEnableOwnerDTO): Promise<boolean> {
-    if (!id) {
-      throw new InvalidParameterException('id');
-    }
-
-    const owner = await this.ownerReadRepository.findByID(id);
-
-    if (!owner) {
-      throw new IDDoesNotExistException();
-    }
-
-    await this.ownerWriteRepository.enable({ id });
-
-    return this.ownerReadRepository.enable({ id });
-  }
+  async enable({ id }: InputEnableOwnerDTO): Promise<boolean> {}
 }
 
killedBy: EnableOwnerService Success Cases should be possible to enable an Owner with an valid ID
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Survived] ObjectLiteral
owner/data/services/EnableOwnerService.ts:38:44
       throw new IDDoesNotExistException();
     }
 
-    await this.ownerWriteRepository.enable({ id });
+    await this.ownerWriteRepository.enable({});
 
     return this.ownerReadRepository.enable({ id });

[Killed] ObjectLiteral
owner/data/services/EnableOwnerService.ts:40:44
 
     await this.ownerWriteRepository.enable({ id });
 
-    return this.ownerReadRepository.enable({ id });
+    return this.ownerReadRepository.enable({});
   }
 }
killedBy: EnableOwnerService Success Cases should be possible to enable an Owner with an valid ID
statusReason: Error: expect(received).toBeTruthy()

Received: false
