[Killed] BlockStatement
owner/data/services/ShowOwnerService.ts:17:70
     private readonly ownerReadRepository: OwnerReadRepository
   ) {}
 
-  async show({ id }: InputShowOwnerDTO): Promise<OutputShowOwnerDTO> {
-    if (!id) {
-      throw new InvalidParameterException('id');
-    }
-
-    const owner = await this.ownerReadRepository.findByID(id);
-
-    if (!owner) {
-      throw new IDDoesNotExistException();
-    }
-
-    return owner;
-  }
+  async show({ id }: InputShowOwnerDTO): Promise<OutputShowOwnerDTO> {}
 }
 
killedBy: ShowOwnerService Success Cases should be possible to show an Owner with an valid ID
statusReason: Error: expect(received).toBeTruthy()

Received: undefined
