[Killed] BlockStatement
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:6:17
 export class OwnerPropsDataBuilder {
   #ownerData: OwnerProps;
 
-  constructor() {
-    this.#ownerData = {
-      id: '1',
-      name: 'John',
-      documentNumber: '12345678901'
-    };
-  }
+  constructor() {}
 
   static props(): OwnerPropsDataBuilder {
killedBy: CreateOwnerService Success Cases should be possible to create an Owner with only name and Document
statusReason: TypeError: Reflect.deleteProperty called on non-object

[Survived] StringLiteral
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:8:11
 
   constructor() {
     this.#ownerData = {
-      id: '1',
+      id: "",
       name: 'John',
       documentNumber: '12345678901'

[Killed] StringLiteral
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:9:13
   constructor() {
     this.#ownerData = {
       id: '1',
-      name: 'John',
+      name: "",
       documentNumber: '12345678901'
     };
killedBy: CreateOwnerService Success Cases should be possible to create an Owner with only name and Document
statusReason: name has invalid characters, name is a required field

[Killed] BlockStatement
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:14:41
     };
   }
 
-  static props(): OwnerPropsDataBuilder {
-    return new OwnerPropsDataBuilder();
-  }
+  static props(): OwnerPropsDataBuilder {}
 
   valid(): OwnerPropsDataBuilder {
killedBy: CreateOwnerService Success Cases should be possible to create an Owner with only name and Document
statusReason: TypeError: Cannot read property 'withoutID' of undefined

[NoCoverage] BlockStatement
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:18:34
     return new OwnerPropsDataBuilder();
   }
 
-  valid(): OwnerPropsDataBuilder {
-    return this;
-  }
+  valid(): OwnerPropsDataBuilder {}
 
   withoutID(): OwnerPropsDataBuilder {

[Killed] BlockStatement
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:22:38
     return this;
   }
 
-  withoutID(): OwnerPropsDataBuilder {
-    Reflect.deleteProperty(this.#ownerData, 'id');
-    return this;
-  }
+  withoutID(): OwnerPropsDataBuilder {}
 
   invalidID(): OwnerPropsDataBuilder {
killedBy: CreateOwnerService Success Cases should be possible to create an Owner with only name and Document
statusReason: TypeError: Cannot read property 'build' of undefined

[NoCoverage] BlockStatement
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:27:38
     return this;
   }
 
-  invalidID(): OwnerPropsDataBuilder {
-    this.#ownerData.id = 'invalid';
-    return this;
-  }
+  invalidID(): OwnerPropsDataBuilder {}
 
   withoutName(): OwnerPropsDataBuilder {

[NoCoverage] StringLiteral
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:28:26
   }
 
   invalidID(): OwnerPropsDataBuilder {
-    this.#ownerData.id = 'invalid';
+    this.#ownerData.id = "";
     return this;
   }

[NoCoverage] BlockStatement
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:32:40
     return this;
   }
 
-  withoutName(): OwnerPropsDataBuilder {
-    Reflect.deleteProperty(this.#ownerData, 'name');
-    return this;
-  }
+  withoutName(): OwnerPropsDataBuilder {}
 
   blankName(): OwnerPropsDataBuilder {

[Killed] BlockStatement
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:37:38
     return this;
   }
 
-  blankName(): OwnerPropsDataBuilder {
-    this.#ownerData.name = '';
-    return this;
-  }
+  blankName(): OwnerPropsDataBuilder {}
 
   invalidName(): OwnerPropsDataBuilder {
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Name
statusReason: TypeError: Cannot read property 'build' of undefined

[Killed] StringLiteral
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:38:28
   }
 
   blankName(): OwnerPropsDataBuilder {
-    this.#ownerData.name = '';
+    this.#ownerData.name = "Stryker was here!";
     return this;
   }
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Name
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "name has invalid characters, name is a required field"
Received value: "name has invalid characters"

[Killed] BlockStatement
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:42:40
     return this;
   }
 
-  invalidName(): OwnerPropsDataBuilder {
-    this.#ownerData.name = 'K$%n4';
-    return this;
-  }
+  invalidName(): OwnerPropsDataBuilder {}
 
   longName(): OwnerPropsDataBuilder {
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Name
statusReason: TypeError: Cannot read property 'build' of undefined

[Killed] BlockStatement
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:47:37
     return this;
   }
 
-  longName(): OwnerPropsDataBuilder {
-    this.#ownerData.name = 'a'.repeat(151);
-    return this;
-  }
+  longName(): OwnerPropsDataBuilder {}
 
   withoutDocumentNumber(): OwnerPropsDataBuilder {
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with name that has more than 150 character
statusReason: TypeError: Cannot read property 'build' of undefined

[NoCoverage] BlockStatement
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:52:50
     return this;
   }
 
-  withoutDocumentNumber(): OwnerPropsDataBuilder {
-    Reflect.deleteProperty(this.#ownerData, 'documentNumber');
-    return this;
-  }
+  withoutDocumentNumber(): OwnerPropsDataBuilder {}
 
   invalidDocumentNumber(): OwnerPropsDataBuilder {

[Killed] BlockStatement
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:57:50
     return this;
   }
 
-  invalidDocumentNumber(): OwnerPropsDataBuilder {
-    this.#ownerData.documentNumber = 'aaaaaaaaaaa';
-    return this;
-  }
+  invalidDocumentNumber(): OwnerPropsDataBuilder {}
 
   blankDocumentNumber(): OwnerPropsDataBuilder {
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Document number
statusReason: TypeError: Cannot read property 'build' of undefined

[Killed] BlockStatement
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:62:48
     return this;
   }
 
-  blankDocumentNumber(): OwnerPropsDataBuilder {
-    this.#ownerData.documentNumber = '';
-    return this;
-  }
+  blankDocumentNumber(): OwnerPropsDataBuilder {}
 
   build(): OwnerProps {
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Document number
statusReason: TypeError: Cannot read property 'build' of undefined

[Killed] BlockStatement
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:67:23
     return this;
   }
 
-  build(): OwnerProps {
-    return this.#ownerData;
-  }
+  build(): OwnerProps {}
 }
 
killedBy: CreateOwnerService Success Cases should be possible to create an Owner with only name and Document
statusReason: TypeError: Cannot destructure property 'name' of 'undefined' as it is undefined.
