[Killed] BlockStatement
sources/mocks/object-mother/OwnerPropsObjectMother.ts:5:30
 import { OwnerPropsDataBuilder } from '../data-builder';
 
 export class OwnerPropsObjectMother {
-  static valid(): OwnerProps {
-    return OwnerPropsDataBuilder.props().withoutID().build();
-  }
+  static valid(): OwnerProps {}
 
   static validWithID(): OwnerProps {
killedBy: CreateOwnerService Success Cases should be possible to create an Owner with only name and Document
statusReason: TypeError: Cannot destructure property 'name' of 'undefined' as it is undefined.

[NoCoverage] BlockStatement
sources/mocks/object-mother/OwnerPropsObjectMother.ts:9:36
     return OwnerPropsDataBuilder.props().withoutID().build();
   }
 
-  static validWithID(): OwnerProps {
-    return OwnerPropsDataBuilder.props().build();
-  }
+  static validWithID(): OwnerProps {}
 
   static withoutID(): OwnerProps {

[NoCoverage] BlockStatement
sources/mocks/object-mother/OwnerPropsObjectMother.ts:13:34
     return OwnerPropsDataBuilder.props().build();
   }
 
-  static withoutID(): OwnerProps {
-    return OwnerPropsDataBuilder.props().withoutID().build();
-  }
+  static withoutID(): OwnerProps {}
 
   static invalidID(): OwnerProps {

[NoCoverage] BlockStatement
sources/mocks/object-mother/OwnerPropsObjectMother.ts:17:34
     return OwnerPropsDataBuilder.props().withoutID().build();
   }
 
-  static invalidID(): OwnerProps {
-    return OwnerPropsDataBuilder.props().invalidID().build();
-  }
+  static invalidID(): OwnerProps {}
 
   static withoutName(): OwnerProps {

[NoCoverage] BlockStatement
sources/mocks/object-mother/OwnerPropsObjectMother.ts:21:36
     return OwnerPropsDataBuilder.props().invalidID().build();
   }
 
-  static withoutName(): OwnerProps {
-    return OwnerPropsDataBuilder.props().withoutName().build();
-  }
+  static withoutName(): OwnerProps {}
 
   static blankName(): OwnerProps {

[Killed] BlockStatement
sources/mocks/object-mother/OwnerPropsObjectMother.ts:25:34
     return OwnerPropsDataBuilder.props().withoutName().build();
   }
 
-  static blankName(): OwnerProps {
-    return OwnerPropsDataBuilder.props().blankName().build();
-  }
+  static blankName(): OwnerProps {}
 
   static invalidName(): OwnerProps {
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Name
statusReason: TypeError: Cannot destructure property 'name' of 'undefined' as it is undefined.

[Killed] BlockStatement
sources/mocks/object-mother/OwnerPropsObjectMother.ts:29:36
     return OwnerPropsDataBuilder.props().blankName().build();
   }
 
-  static invalidName(): OwnerProps {
-    return OwnerPropsDataBuilder.props().invalidName().build();
-  }
+  static invalidName(): OwnerProps {}
 
   static longName(): OwnerProps {
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Name
statusReason: TypeError: Cannot destructure property 'name' of 'undefined' as it is undefined.

[Killed] BlockStatement
sources/mocks/object-mother/OwnerPropsObjectMother.ts:33:33
     return OwnerPropsDataBuilder.props().invalidName().build();
   }
 
-  static longName(): OwnerProps {
-    return OwnerPropsDataBuilder.props().longName().build();
-  }
+  static longName(): OwnerProps {}
 
   static withoutDocumentNumber(): OwnerProps {
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with name that has more than 150 character
statusReason: TypeError: Cannot destructure property 'name' of 'undefined' as it is undefined.

[NoCoverage] BlockStatement
sources/mocks/object-mother/OwnerPropsObjectMother.ts:37:46
     return OwnerPropsDataBuilder.props().longName().build();
   }
 
-  static withoutDocumentNumber(): OwnerProps {
-    return OwnerPropsDataBuilder.props().withoutDocumentNumber().build();
-  }
+  static withoutDocumentNumber(): OwnerProps {}
 
   static invalidDocumentNumber(): OwnerProps {

[Killed] BlockStatement
sources/mocks/object-mother/OwnerPropsObjectMother.ts:41:46
     return OwnerPropsDataBuilder.props().withoutDocumentNumber().build();
   }
 
-  static invalidDocumentNumber(): OwnerProps {
-    return OwnerPropsDataBuilder.props().invalidDocumentNumber().build();
-  }
+  static invalidDocumentNumber(): OwnerProps {}
 
   static blankDocumentNumber(): OwnerProps {
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Document number
statusReason: TypeError: Cannot destructure property 'name' of 'undefined' as it is undefined.

[Killed] BlockStatement
sources/mocks/object-mother/OwnerPropsObjectMother.ts:45:44
     return OwnerPropsDataBuilder.props().invalidDocumentNumber().build();
   }
 
-  static blankDocumentNumber(): OwnerProps {
-    return OwnerPropsDataBuilder.props().blankDocumentNumber().build();
-  }
+  static blankDocumentNumber(): OwnerProps {}
 }
 
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Document number
statusReason: TypeError: Cannot destructure property 'name' of 'undefined' as it is undefined.
