[Killed] BlockStatement
owner/domain/entities/Owner.ts:22:38
 
     this.validateOwner();
 
-    if (this.validation.hasErrors()) {
-      throw new ValidationException(this.validation.messages('owner'));
-    }
+    if (this.validation.hasErrors()) {}
   }
 
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Name
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected

[Killed] BlockStatement
owner/domain/entities/Owner.ts:27:27
     }
   }
 
-  private validateOwner() {
-    if (!this.validator) {
-      throw new ValidatorNotAvailableException('Owner Validator not available');
-    }
-    this.validator.validate(this);
-  }
+  private validateOwner() {}
 }
 
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Name
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected
Resolved to value: {"document": {"number": "12345678901", "type": "CPF", "validation": {"errors": []}, "validator": {}}, "name": "", "validation": {"errors": []}, "validator": {}}

[Killed] ConditionalExpression
owner/domain/entities/Owner.ts:28:9
   }
 
   private validateOwner() {
-    if (!this.validator) {
+    if (true) {
       throw new ValidatorNotAvailableException('Owner Validator not available');
     }
killedBy: FakeOwnerWriteRepository should be possible to create an Repository Owner
statusReason: Owner Validator not available

[Killed] BooleanLiteral
owner/domain/entities/Owner.ts:28:9
   }
 
   private validateOwner() {
-    if (!this.validator) {
+    if (this.validator) {
       throw new ValidatorNotAvailableException('Owner Validator not available');
     }
killedBy: FakeOwnerWriteRepository should be possible to create an Repository Owner
statusReason: Owner Validator not available

[NoCoverage] StringLiteral
owner/domain/entities/Owner.ts:29:48
 
   private validateOwner() {
     if (!this.validator) {
-      throw new ValidatorNotAvailableException('Owner Validator not available');
+      throw new ValidatorNotAvailableException("");
     }
     this.validator.validate(this);
