[Killed] BlockStatement
owner/infra/repositories/FakeOwnerReadRepository.ts:14:63
 export class FakeOwnerReadRepository implements OwnerReadRepository {
   owners: RepositoryOwnerModel[] = [];
 
-  async create(owner: RepositoryOwnerModel): Promise<boolean> {
-    this.owners.push(owner);
-
-    return true;
-  }
+  async create(owner: RepositoryOwnerModel): Promise<boolean> {}
 
   async replace(owner: RepositoryOwnerModel): Promise<boolean> {
killedBy: CreateOwnerService Exception Cases should not be possible to create an Owner with same Document
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected
Resolved to value: {"document": {"number": "12345678901", "type": "CPF", "validation": {"errors": []}, "validator": {}}, "name": "John", "validation": {"errors": []}, "validator": {}}

[Killed] BlockStatement
owner/infra/repositories/FakeOwnerReadRepository.ts:20:64
     return true;
   }
 
-  async replace(owner: RepositoryOwnerModel): Promise<boolean> {
-    const existingOwnerIndex = this.findOwnerIndex(owner.id);
-
-    this.owners[existingOwnerIndex] = owner;
-
-    return true;
-  }
+  async replace(owner: RepositoryOwnerModel): Promise<boolean> {}
 
   async enable(enableOwner: EnableOwnerDTO): Promise<boolean> {
killedBy: FakeOwnerReadRepository should be possible to replace an Repository Owner
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] BlockStatement
owner/infra/repositories/FakeOwnerReadRepository.ts:28:63
     return true;
   }
 
-  async enable(enableOwner: EnableOwnerDTO): Promise<boolean> {
-    const existingOwnerIndex = this.findOwnerIndex(enableOwner.id);
-
-    if (existingOwnerIndex < 0) {
-      return false;
-    }
-
-    this.owners[existingOwnerIndex].deleted_at = null;
-
-    return true;
-  }
+  async enable(enableOwner: EnableOwnerDTO): Promise<boolean> {}
 
   async disable(disableOwner: DisableOwnerDTO): Promise<boolean> {
killedBy: EnableOwnerService Success Cases should be possible to enable an Owner with an valid ID
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] BlockStatement
owner/infra/repositories/FakeOwnerReadRepository.ts:40:66
     return true;
   }
 
-  async disable(disableOwner: DisableOwnerDTO): Promise<boolean> {
-    const existingOwnerIndex = this.findOwnerIndex(disableOwner.id);
-
-    if (existingOwnerIndex < 0) {
-      return false;
-    }
-
-    this.owners[existingOwnerIndex].deleted_at = new Date();
-
-    return true;
-  }
+  async disable(disableOwner: DisableOwnerDTO): Promise<boolean> {}
 
   async findByID(id: string): Promise<RepositoryOwnerModel> {
killedBy: DisableOwnerService Success Cases should be possible to disable an Owner with an valid ID
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] BlockStatement
owner/infra/repositories/FakeOwnerReadRepository.ts:52:61
     return true;
   }
 
-  async findByID(id: string): Promise<RepositoryOwnerModel> {
-    const existingOwnerIndex = this.findOwnerIndex(id);
-
-    return this.owners[existingOwnerIndex];
-  }
+  async findByID(id: string): Promise<RepositoryOwnerModel> {}
 
   async findByDocument(document: DocumentProps): Promise<RepositoryOwnerModel> {
killedBy: FakeOwnerReadRepository should be possible to find an Owner by ID
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] BlockStatement
owner/infra/repositories/FakeOwnerReadRepository.ts:58:80
     return this.owners[existingOwnerIndex];
   }
 
-  async findByDocument(document: DocumentProps): Promise<RepositoryOwnerModel> {
-    const documentCheck = new DocumentModel(
-      document,
-      DocumentValidatorFactory.create()
-    );
-
-    const existingOwnerIndex = this.owners.findIndex(foundOwner =>
-      foundOwner.document.isEqual(documentCheck)
-    );
-
-    return this.owners[existingOwnerIndex];
-  }
+  async findByDocument(document: DocumentProps): Promise<RepositoryOwnerModel> {}
 
   private findOwnerIndex(id: string): number {
killedBy: FakeOwnerReadRepository should be possible to find an Owner by Document
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] BlockStatement
owner/infra/repositories/FakeOwnerReadRepository.ts:71:46
     return this.owners[existingOwnerIndex];
   }
 
-  private findOwnerIndex(id: string): number {
-    return this.owners.findIndex(foundOwner => foundOwner.id === id);
-  }
+  private findOwnerIndex(id: string): number {}
 }
 
killedBy: FakeOwnerReadRepository should be possible to replace an Repository Owner
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Test 2"
Received: "Test"
