[Killed] BlockStatement
owner/infra/repositories/FakeOwnerWriteRepository.ts:9:66
 export class FakeOwnerWriteRepository implements OwnerWriteRepository {
   owners: RepositoryOwnerModel[] = [];
 
-  async create(owner: OwnerModel): Promise<RepositoryOwnerModel> {
-    const persistedOwner = new RepositoryOwnerModel({ ...owner });
-
-    this.owners.push(persistedOwner);
-
-    return persistedOwner;
-  }
+  async create(owner: OwnerModel): Promise<RepositoryOwnerModel> {}
 
   async update(owner: RepositoryOwnerModel): Promise<boolean> {
killedBy: UpdateOwnerService Success Cases should be possible update an Owner's name
statusReason: TypeError: Cannot read property 'id' of undefined

[Killed] BlockStatement
owner/infra/repositories/FakeOwnerWriteRepository.ts:17:63
     return persistedOwner;
   }
 
-  async update(owner: RepositoryOwnerModel): Promise<boolean> {
-    const existingOwnerIndex = this.findOwnerIndex(owner.id);
-
-    if (existingOwnerIndex < 0) {
-      return false;
-    }
-
-    this.owners[existingOwnerIndex] = new RepositoryOwnerModel({ ...owner });
-
-    return true;
-  }
+  async update(owner: RepositoryOwnerModel): Promise<boolean> {}
 
   async enable(enableOwner: EnableOwnerDTO): Promise<boolean> {
killedBy: FakeOwnerWriteRepository should be possible to update an Repository Owner
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ArrowFunction
owner/infra/repositories/FakeOwnerWriteRepository.ts:54:34
   }
 
   private findOwnerIndex(id: string): number {
-    return this.owners.findIndex(foundOwner => foundOwner.id === id);
+    return this.owners.findIndex(() => undefined);
   }
 }
killedBy: FakeOwnerWriteRepository should be possible to update an Repository Owner
statusReason: Error: expect(received).toBeTruthy()

Received: false
