[Killed] BlockStatement
presentation/controllers/http/OwnerHttpControllerImplementation.ts:41:61
     private readonly showOwner: ShowOwner
   ) {}
 
-  async create(request: HttpRequest): Promise<ResponseType> {
-    try {
-      const inputDto = request.body as InputCreateOwnerDTO;
-
-      const outputDto = await this.createOwner.create(inputDto);
-
-      return OwnerPresenter.ownerCreatedResponse(outputDto);
-    } catch (err) {
-      const error = err as Exception;
-
-      return ErrorResponse(error);
-    }
-  }
+  async create(request: HttpRequest): Promise<ResponseType> {}
 
   async update(request: HttpRequest): Promise<ResponseType> {
killedBy: OwnerHttpControllerImplementation create should return an Http Response with Owner View Model
statusReason: TypeError: Cannot read property 'data' of undefined

[Killed] BlockStatement
presentation/controllers/http/OwnerHttpControllerImplementation.ts:42:9
   ) {}
 
   async create(request: HttpRequest): Promise<ResponseType> {
-    try {
-      const inputDto = request.body as InputCreateOwnerDTO;
-
-      const outputDto = await this.createOwner.create(inputDto);
-
-      return OwnerPresenter.ownerCreatedResponse(outputDto);
-    } catch (err) {
+    try {} catch (err) {
       const error = err as Exception;
 
killedBy: OwnerHttpControllerImplementation create should return an Http Response with Owner View Model
statusReason: TypeError: Cannot read property 'data' of undefined

[Killed] BlockStatement
presentation/controllers/http/OwnerHttpControllerImplementation.ts:48:19
       const outputDto = await this.createOwner.create(inputDto);
 
       return OwnerPresenter.ownerCreatedResponse(outputDto);
-    } catch (err) {
-      const error = err as Exception;
-
-      return ErrorResponse(error);
-    }
+    } catch (err) {}
   }
 
killedBy: OwnerHttpControllerImplementation create should return an Http Response with status code 400 if Document is invalid
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[NoCoverage] BlockStatement
presentation/controllers/http/OwnerHttpControllerImplementation.ts:55:61
     }
   }
 
-  async update(request: HttpRequest): Promise<ResponseType> {
-    try {
-      const inputDto = request.body as InputUpdateOwnerDTO;
-
-      const outputDto = await this.updateOwner.update(inputDto);
-
-      return OwnerPresenter.ownerUpdatedResponse(outputDto);
-    } catch (err) {
-      const error = err as Exception;
-
-      return ErrorResponse(error);
-    }
-  }
+  async update(request: HttpRequest): Promise<ResponseType> {}
 
   async show(request: HttpRequest): Promise<ResponseType> {

[NoCoverage] BlockStatement
presentation/controllers/http/OwnerHttpControllerImplementation.ts:56:9
   }
 
   async update(request: HttpRequest): Promise<ResponseType> {
-    try {
-      const inputDto = request.body as InputUpdateOwnerDTO;
-
-      const outputDto = await this.updateOwner.update(inputDto);
-
-      return OwnerPresenter.ownerUpdatedResponse(outputDto);
-    } catch (err) {
+    try {} catch (err) {
       const error = err as Exception;
 

[NoCoverage] BlockStatement
presentation/controllers/http/OwnerHttpControllerImplementation.ts:62:19
       const outputDto = await this.updateOwner.update(inputDto);
 
       return OwnerPresenter.ownerUpdatedResponse(outputDto);
-    } catch (err) {
-      const error = err as Exception;
-
-      return ErrorResponse(error);
-    }
+    } catch (err) {}
   }
 

[NoCoverage] BlockStatement
presentation/controllers/http/OwnerHttpControllerImplementation.ts:69:59
     }
   }
 
-  async show(request: HttpRequest): Promise<ResponseType> {
-    try {
-      const inputDto = request.body as InputShowOwnerDTO;
-
-      const outputDto = await this.showOwner.show(inputDto);
-
-      return OwnerPresenter.ownerShowedResponse(outputDto);
-    } catch (err) {
-      const error = err as Exception;
-
-      return ErrorResponse(error);
-    }
-  }
+  async show(request: HttpRequest): Promise<ResponseType> {}
 }
 

[NoCoverage] BlockStatement
presentation/controllers/http/OwnerHttpControllerImplementation.ts:70:9
   }
 
   async show(request: HttpRequest): Promise<ResponseType> {
-    try {
-      const inputDto = request.body as InputShowOwnerDTO;
-
-      const outputDto = await this.showOwner.show(inputDto);
-
-      return OwnerPresenter.ownerShowedResponse(outputDto);
-    } catch (err) {
+    try {} catch (err) {
       const error = err as Exception;
 

[NoCoverage] BlockStatement
presentation/controllers/http/OwnerHttpControllerImplementation.ts:76:19
       const outputDto = await this.showOwner.show(inputDto);
 
       return OwnerPresenter.ownerShowedResponse(outputDto);
-    } catch (err) {
-      const error = err as Exception;
-
-      return ErrorResponse(error);
-    }
+    } catch (err) {}
   }
 }
