[Killed] BlockStatement
owner/presentation/presenters/OwnerPresenter.ts:19:35
 
   static ownerCreatedResponse(
     outputDTO: OutputCreateOwnerDTO
-  ): HttpResponse<OwnerViewModel> {
-    const viewModel: OwnerViewModel = {
-      id: outputDTO.id,
-      name: outputDTO.name
-    };
-
-    return this.ownerHttpResponses.created(viewModel);
-  }
+  ): HttpResponse<OwnerViewModel> {}
 
   static ownerUpdatedResponse(
killedBy: OwnerHttpControllerImplementation create should return an Http Response with Owner View Model
statusReason: TypeError: Cannot read property 'data' of undefined

[Killed] ObjectLiteral
owner/presentation/presenters/OwnerPresenter.ts:20:39
   static ownerCreatedResponse(
     outputDTO: OutputCreateOwnerDTO
   ): HttpResponse<OwnerViewModel> {
-    const viewModel: OwnerViewModel = {
-      id: outputDTO.id,
-      name: outputDTO.name
-    };
+    const viewModel: OwnerViewModel = {};
 
     return this.ownerHttpResponses.created(viewModel);
killedBy: OwnerHttpControllerImplementation create should return an Http Response with Owner View Model
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "John"
Received: undefined

[NoCoverage] BlockStatement
owner/presentation/presenters/OwnerPresenter.ts:30:35
 
   static ownerUpdatedResponse(
     outputDTO: OutputUpdateOwnerDTO
-  ): HttpResponse<OwnerViewModel> {
-    return this[kHttpResponseOk](outputDTO);
-  }
+  ): HttpResponse<OwnerViewModel> {}
 
   static ownerShowedResponse(

[NoCoverage] BlockStatement
owner/presentation/presenters/OwnerPresenter.ts:36:35
 
   static ownerShowedResponse(
     outputDTO: OutputShowOwnerDTO
-  ): HttpResponse<OwnerViewModel> {
-    return this[kHttpResponseOk](outputDTO);
-  }
+  ): HttpResponse<OwnerViewModel> {}
 
   static [kHttpResponseOk](

[NoCoverage] BlockStatement
owner/presentation/presenters/OwnerPresenter.ts:42:35
 
   static [kHttpResponseOk](
     outputDTO: OwnerViewModel
-  ): HttpResponse<OwnerViewModel> {
-    const viewModel: OwnerViewModel = { ...outputDTO };
-
-    return this.ownerHttpResponses.ok(viewModel);
-  }
+  ): HttpResponse<OwnerViewModel> {}
 }
 

[NoCoverage] ObjectLiteral
owner/presentation/presenters/OwnerPresenter.ts:43:39
   static [kHttpResponseOk](
     outputDTO: OwnerViewModel
   ): HttpResponse<OwnerViewModel> {
-    const viewModel: OwnerViewModel = { ...outputDTO };
+    const viewModel: OwnerViewModel = {};
 
     return this.ownerHttpResponses.ok(viewModel);
