[NoCoverage] BlockStatement
data/contracts/exceptions/InvalidNameException.ts:5:32
 import { Exception } from './Exception';
 
 export class InvalidNameException extends Exception {
-  constructor(message: string) {
-    super({
-      name: 'InvalidNameException',
-      message,
-      statusCode: HttpConstants.BAD_REQUEST
-    });
-  }
+  constructor(message: string) {}
 }
 
