[NoCoverage] BlockStatement
data/contracts/exceptions/InvalidParameterException.ts:5:38
 import { Exception } from './Exception';
 
 export class InvalidParameterException extends Exception {
-  constructor(parameterName: string) {
-    super({
-      name: 'InvalidParameterException',
-      message: `Parameter ${parameterName} is invalid!`,
-      statusCode: HttpConstants.BAD_REQUEST
-    });
-  }
+  constructor(parameterName: string) {}
 }
 
