[NoCoverage] BlockStatement
data/contracts/exceptions/ValidatorNotAvailableException.ts:5:32
 import { Exception } from './Exception';
 
 export class ValidatorNotAvailableException extends Exception {
-  constructor(message: string) {
-    super({
-      message,
-      name: 'ValidatorNotAvailableException',
-      statusCode: HttpConstants.BAD_REQUEST
-    });
-  }
+  constructor(message: string) {}
 }
 

[NoCoverage] ObjectLiteral
data/contracts/exceptions/ValidatorNotAvailableException.ts:6:11
 
 export class ValidatorNotAvailableException extends Exception {
   constructor(message: string) {
-    super({
-      message,
-      name: 'ValidatorNotAvailableException',
-      statusCode: HttpConstants.BAD_REQUEST
-    });
+    super({});
   }
 }

[NoCoverage] StringLiteral
data/contracts/exceptions/ValidatorNotAvailableException.ts:8:13
   constructor(message: string) {
     super({
       message,
-      name: 'ValidatorNotAvailableException',
+      name: "",
       statusCode: HttpConstants.BAD_REQUEST
     });
