[NoCoverage] BlockStatement
sources/utils/mocks/MockDataFunctions.ts:3:73
 import crypto from 'crypto';
 
-export function RandomInRange(minimum: number, maximum: number): number {
-  const randomNumber = crypto.randomInt(maximum);
-
-  const normalizedNumber = Math.abs(
-    (randomNumber - minimum) / (maximum - minimum)
-  );
-
-  return Math.floor(normalizedNumber * (maximum - minimum) + minimum);
-}
+export function RandomInRange(minimum: number, maximum: number): number {}
 

[NoCoverage] ArithmeticOperator
sources/utils/mocks/MockDataFunctions.ts:7:5
   const randomNumber = crypto.randomInt(maximum);
 
   const normalizedNumber = Math.abs(
-    (randomNumber - minimum) / (maximum - minimum)
+    (randomNumber - minimum) * (maximum - minimum)
   );
 

[NoCoverage] ArithmeticOperator
sources/utils/mocks/MockDataFunctions.ts:7:6
   const randomNumber = crypto.randomInt(maximum);
 
   const normalizedNumber = Math.abs(
-    (randomNumber - minimum) / (maximum - minimum)
+    (randomNumber + minimum) / (maximum - minimum)
   );
 

[NoCoverage] ArithmeticOperator
sources/utils/mocks/MockDataFunctions.ts:10:21
     (randomNumber - minimum) / (maximum - minimum)
   );
 
-  return Math.floor(normalizedNumber * (maximum - minimum) + minimum);
+  return Math.floor(normalizedNumber / (maximum - minimum) + minimum);
 }
 

[NoCoverage] ArithmeticOperator
sources/utils/mocks/MockDataFunctions.ts:10:21
     (randomNumber - minimum) / (maximum - minimum)
   );
 
-  return Math.floor(normalizedNumber * (maximum - minimum) + minimum);
+  return Math.floor(normalizedNumber * (maximum - minimum) - minimum);
 }
 
