[NoCoverage] BlockStatement
shared/domain/value_objects/Address.ts:100:35
     }
   }
 
-  public toBrazilString(): string {
-    return (
-      `${this.country}, ${this.state}, ${this.city}, ${this.street}` +
-      ` nº${this.number}, ${this.neighborhood} - CEP: ${this.zip_code}`
-    );
-  }
+  public toBrazilString(): string {}
 }
 
