[NoCoverage] BlockStatement
shared/domain/value_objects/Phone.ts:48:34
     }
   }
 
-  validateBrazilPhone(): boolean {
-    const phoneNumberLength = PhoneConstants.PHONE_NUMBER_LENGTH;
-    const prefixLength = PhoneConstants.PREFIX_LENGTH;
-
-    if (this.prefix.length !== prefixLength) {
-      throw new Error('Invalid phone prefix');
-    }
-
-    if (!/^[0-9]+$/.test(this.prefix)) {
-      throw new Error('Invalid phone prefix');
-    }
-
-    if (this.number.length !== phoneNumberLength) {
-      throw new Error('Invalid phone number');
-    }
-
-    if (!/^[0-9]+$/.test(this.number)) {
-      throw new Error('Invalid phone number');
-    }
-
-    return true;
-  }
+  validateBrazilPhone(): boolean {}
 
   toString(): string {

[NoCoverage] BlockStatement
shared/domain/value_objects/Phone.ts:71:22
     return true;
   }
 
-  toString(): string {
-    return `+${this.country_code} (${this.prefix}) ${this.number}`;
-  }
+  toString(): string {}
 }
 
