[NoCoverage] BlockStatement
domain/value_objects/document/Document.ts:32:52
     this.validator.validate(this);
   }
 
-  public static validateCPF(_cpf: string): boolean {
-    return true;
-  }
+  public static validateCPF(_cpf: string): boolean {}
 
   public static validateCNPJ(_cnpj: string): boolean {

[NoCoverage] BlockStatement
domain/value_objects/document/Document.ts:36:54
     return true;
   }
 
-  public static validateCNPJ(_cnpj: string): boolean {
-    return true;
-  }
+  public static validateCNPJ(_cnpj: string): boolean {}
 
   public formatDocumentNumber(): string {

[NoCoverage] BlockStatement
domain/value_objects/document/Document.ts:40:41
     return true;
   }
 
-  public formatDocumentNumber(): string {
-    return `${this.number}`;
-  }
+  public formatDocumentNumber(): string {}
 
   public getDocumentValues(): Partial<Document> {

[Killed] BlockStatement
domain/value_objects/document/Document.ts:44:49
     return `${this.number}`;
   }
 
-  public getDocumentValues(): Partial<Document> {
-    return {
-      number: this.number,
-      type: this.type
-    };
-  }
+  public getDocumentValues(): Partial<Document> {}
 
   public override toString(): string {
killedBy: CreateOwnerService Success Cases should be possible to create an Owner with only name and Document
statusReason: TypeError: Cannot destructure property 'number' of 'owner.document.getDocumentValues(...)' as it is undefined.

[Survived] BlockStatement
domain/value_objects/document/Document.ts:51:38
     };
   }
 
-  public override toString(): string {
-    return `${this.type},${this.number}`;
-  }
+  public override toString(): string {}
 
   public isEqual(document: Document): boolean {

[Killed] BlockStatement
domain/value_objects/document/Document.ts:55:47
     return `${this.type},${this.number}`;
   }
 
-  public isEqual(document: Document): boolean {
-    return this.toString() === document.toString();
-  }
+  public isEqual(document: Document): boolean {}
 }
 
killedBy: FakeOwnerReadRepository should be possible to find an Owner by Document
statusReason: Error: expect(received).toBeTruthy()

Received: undefined
