[Survived] ObjectLiteral
presentation/contracts/http/HttpResponse.ts:8:50
   data: T;
 };
 
-export const InternalServerError: HttpResponse = {
-  statusCode: 500,
-  data: new Exception({
-    message: 'An internal error occurred, please try again!!',
-    name: 'Internal Server Error'
-  })
-};
+export const InternalServerError: HttpResponse = {};
 
 export class HttpResponses<T> {

[Survived] ObjectLiteral
presentation/contracts/http/HttpResponse.ts:10:23
 
 export const InternalServerError: HttpResponse = {
   statusCode: 500,
-  data: new Exception({
-    message: 'An internal error occurred, please try again!!',
-    name: 'Internal Server Error'
-  })
+  data: new Exception({})
 };
 

[NoCoverage] BlockStatement
presentation/contracts/http/HttpResponse.ts:17:32
 };
 
 export class HttpResponses<T> {
-  ok(data: T): HttpResponse<T> {
-    return {
-      statusCode: 200,
-      data
-    };
-  }
+  ok(data: T): HttpResponse<T> {}
 
   created(data: T): HttpResponse<T> {

[Killed] BlockStatement
presentation/contracts/http/HttpResponse.ts:24:37
     };
   }
 
-  created(data: T): HttpResponse<T> {
-    return {
-      statusCode: 201,
-      data
-    };
-  }
+  created(data: T): HttpResponse<T> {}
 }
 
killedBy: OwnerHttpControllerImplementation create should return an Http Response with Owner View Model
statusReason: TypeError: Cannot read property 'data' of undefined

[Killed] BlockStatement
presentation/contracts/http/HttpResponse.ts:32:77
   }
 }
 
-export const ErrorResponse = (error: Exception): HttpResponse<Exception> => {
-  return {
-    statusCode: error.statusCode,
-    data: error
-  };
-};
+export const ErrorResponse = (error: Exception): HttpResponse<Exception> => {};
 
killedBy: OwnerHttpControllerImplementation create should return an Http Response with status code 400 if Document is invalid
statusReason: Error: expect(received).toBeTruthy()

Received: undefined
