[NoCoverage] ObjectLiteral
store/config/constants/RecommendationConstants.ts:1:40
-export const RecommendationConstants = {
-  MINIMUM_STARS: 1,
-  MAXIMUM_STARS: 5,
-  COMMENT_MAX_LENGTH: 300
-};
+export const RecommendationConstants = {};
 
