[NoCoverage] BlockStatement
store/domain/entities/Recommendation.ts:15:46
 
   stars!: number;
 
-  constructor(data: Partial<Recommendation>) {
-    Object.assign(this, data);
-
-    this.validateRecommendation();
-  }
+  constructor(data: Partial<Recommendation>) {}
 
   validateRecommendation(): void {

[NoCoverage] BlockStatement
store/domain/entities/Recommendation.ts:21:34
     this.validateRecommendation();
   }
 
-  validateRecommendation(): void {
-    const minimumStars = RecommendationConstants.MINIMUM_STARS;
-    const maximumStars = RecommendationConstants.MAXIMUM_STARS;
-    const commentMaxLength = RecommendationConstants.COMMENT_MAX_LENGTH;
-
-    if (
-      !(this.intendedStore && this.comment && this.isPositive && this.stars)
-    ) {
-      throw new Error('Recommendation values must not be null!');
-    }
-
-    if (this.stars < minimumStars || this.stars > maximumStars) {
-      throw new Error(
-        `Stars must be between ${minimumStars} and ${maximumStars}!`
-      );
-    }
-
-    if (this.comment.length > commentMaxLength) {
-      throw new Error(
-        `Comment must be less than ${commentMaxLength} characters!`
-      );
-    }
-  }
+  validateRecommendation(): void {}
 }
 

[NoCoverage] LogicalOperator
store/domain/entities/Recommendation.ts:27:9
     const commentMaxLength = RecommendationConstants.COMMENT_MAX_LENGTH;
 
     if (
-      !(this.intendedStore && this.comment && this.isPositive && this.stars)
+      !(this.intendedStore || this.comment && this.isPositive && this.stars)
     ) {
       throw new Error('Recommendation values must not be null!');

[NoCoverage] BooleanLiteral
store/domain/entities/Recommendation.ts:27:7
     const commentMaxLength = RecommendationConstants.COMMENT_MAX_LENGTH;
 
     if (
-      !(this.intendedStore && this.comment && this.isPositive && this.stars)
+      this.intendedStore && this.comment && this.isPositive && this.stars
     ) {
       throw new Error('Recommendation values must not be null!');

[NoCoverage] BlockStatement
store/domain/entities/Recommendation.ts:28:7
 
     if (
       !(this.intendedStore && this.comment && this.isPositive && this.stars)
-    ) {
-      throw new Error('Recommendation values must not be null!');
-    }
+    ) {}
 
     if (this.stars < minimumStars || this.stars > maximumStars) {

[NoCoverage] StringLiteral
store/domain/entities/Recommendation.ts:29:23
     if (
       !(this.intendedStore && this.comment && this.isPositive && this.stars)
     ) {
-      throw new Error('Recommendation values must not be null!');
+      throw new Error("");
     }
 

[NoCoverage] EqualityOperator
store/domain/entities/Recommendation.ts:32:9
       throw new Error('Recommendation values must not be null!');
     }
 
-    if (this.stars < minimumStars || this.stars > maximumStars) {
+    if (this.stars >= minimumStars || this.stars > maximumStars) {
       throw new Error(
         `Stars must be between ${minimumStars} and ${maximumStars}!`

[NoCoverage] ConditionalExpression
store/domain/entities/Recommendation.ts:32:38
       throw new Error('Recommendation values must not be null!');
     }
 
-    if (this.stars < minimumStars || this.stars > maximumStars) {
+    if (this.stars < minimumStars || false) {
       throw new Error(
         `Stars must be between ${minimumStars} and ${maximumStars}!`

[NoCoverage] ConditionalExpression
store/domain/entities/Recommendation.ts:38:9
       );
     }
 
-    if (this.comment.length > commentMaxLength) {
+    if (false) {
       throw new Error(
         `Comment must be less than ${commentMaxLength} characters!`

[NoCoverage] EqualityOperator
store/domain/entities/Recommendation.ts:38:9
       );
     }
 
-    if (this.comment.length > commentMaxLength) {
+    if (this.comment.length <= commentMaxLength) {
       throw new Error(
         `Comment must be less than ${commentMaxLength} characters!`
