[NoCoverage] BooleanLiteral
store/domain/entities/Store.ts:22:15
 
   document!: Document;
 
-  isEnabled = false;
+  isEnabled = true;
 
   stars = 0;

[NoCoverage] BlockStatement
store/domain/entities/Store.ts:26:37
 
   stars = 0;
 
-  constructor(data: Partial<Store>) {
-    Object.assign(this, data);
-
-    this.validateStore();
-  }
+  constructor(data: Partial<Store>) {}
 
   validateStore() {

[NoCoverage] BlockStatement
store/domain/entities/Store.ts:32:19
     this.validateStore();
   }
 
-  validateStore() {
-    const nameMaxLength = StoreConstants.NAME_MAX_LENGTH;
-
-    if (!(this.name && this.address && this.phone && this.document)) {
-      throw new Error('Store values must not be null!');
-    }
-
-    if (this.name.length > nameMaxLength) {
-      throw new Error(
-        `Store name must be less than ${nameMaxLength} characters!`
-      );
-    }
-  }
+  validateStore() {}
 }
 

[NoCoverage] ConditionalExpression
store/domain/entities/Store.ts:35:11
   validateStore() {
     const nameMaxLength = StoreConstants.NAME_MAX_LENGTH;
 
-    if (!(this.name && this.address && this.phone && this.document)) {
+    if (!(true)) {
       throw new Error('Store values must not be null!');
     }

[NoCoverage] ConditionalExpression
store/domain/entities/Store.ts:35:11
   validateStore() {
     const nameMaxLength = StoreConstants.NAME_MAX_LENGTH;
 
-    if (!(this.name && this.address && this.phone && this.document)) {
+    if (!(true && this.document)) {
       throw new Error('Store values must not be null!');
     }

[NoCoverage] EqualityOperator
store/domain/entities/Store.ts:39:9
       throw new Error('Store values must not be null!');
     }
 
-    if (this.name.length > nameMaxLength) {
+    if (this.name.length >= nameMaxLength) {
       throw new Error(
         `Store name must be less than ${nameMaxLength} characters!`
