[NoCoverage] BooleanLiteral
store/domain/value_objects/Availability.ts:11:12
 
   waitingTime!: number;
 
-  isOpen = false;
+  isOpen = true;
 
   status = StoreStatus.Closed;

[NoCoverage] BlockStatement
store/domain/value_objects/Availability.ts:15:44
 
   status = StoreStatus.Closed;
 
-  constructor(data: Partial<Availability>) {
-    Object.assign(this, data);
-
-    this.validateAvailability();
-  }
+  constructor(data: Partial<Availability>) {}
 
   validateAvailability(): void {

[NoCoverage] BlockStatement
store/domain/value_objects/Availability.ts:21:32
     this.validateAvailability();
   }
 
-  validateAvailability(): void {
-    const minWaitingTime = AvailabilityConstants.MIN_WAITING_TIME;
-
-    if (!(this.openHour && this.closeHour && this.waitingTime !== undefined)) {
-      throw new Error('Availability values must not be null!');
-    }
-
-    if (this.openHour > this.closeHour) {
-      throw new Error('Open hour must be before close hour!');
-    }
-
-    if (this.waitingTime < minWaitingTime) {
-      throw new Error(`Waiting time must be greater than ${minWaitingTime}!`);
-    }
-  }
+  validateAvailability(): void {}
 
   toString(): string {

[NoCoverage] ConditionalExpression
store/domain/value_objects/Availability.ts:24:9
   validateAvailability(): void {
     const minWaitingTime = AvailabilityConstants.MIN_WAITING_TIME;
 
-    if (!(this.openHour && this.closeHour && this.waitingTime !== undefined)) {
+    if (true) {
       throw new Error('Availability values must not be null!');
     }

[NoCoverage] LogicalOperator
store/domain/value_objects/Availability.ts:24:11
   validateAvailability(): void {
     const minWaitingTime = AvailabilityConstants.MIN_WAITING_TIME;
 
-    if (!(this.openHour && this.closeHour && this.waitingTime !== undefined)) {
+    if (!(this.openHour || this.closeHour && this.waitingTime !== undefined)) {
       throw new Error('Availability values must not be null!');
     }

[NoCoverage] StringLiteral
store/domain/value_objects/Availability.ts:25:23
     const minWaitingTime = AvailabilityConstants.MIN_WAITING_TIME;
 
     if (!(this.openHour && this.closeHour && this.waitingTime !== undefined)) {
-      throw new Error('Availability values must not be null!');
+      throw new Error("");
     }
 

[NoCoverage] ConditionalExpression
store/domain/value_objects/Availability.ts:28:9
       throw new Error('Availability values must not be null!');
     }
 
-    if (this.openHour > this.closeHour) {
+    if (true) {
       throw new Error('Open hour must be before close hour!');
     }

[NoCoverage] EqualityOperator
store/domain/value_objects/Availability.ts:28:9
       throw new Error('Availability values must not be null!');
     }
 
-    if (this.openHour > this.closeHour) {
+    if (this.openHour >= this.closeHour) {
       throw new Error('Open hour must be before close hour!');
     }

[NoCoverage] BlockStatement
store/domain/value_objects/Availability.ts:32:44
       throw new Error('Open hour must be before close hour!');
     }
 
-    if (this.waitingTime < minWaitingTime) {
-      throw new Error(`Waiting time must be greater than ${minWaitingTime}!`);
-    }
+    if (this.waitingTime < minWaitingTime) {}
   }
 

[NoCoverage] ConditionalExpression
store/domain/value_objects/Availability.ts:32:9
       throw new Error('Open hour must be before close hour!');
     }
 
-    if (this.waitingTime < minWaitingTime) {
+    if (false) {
       throw new Error(`Waiting time must be greater than ${minWaitingTime}!`);
     }

[NoCoverage] BlockStatement
store/domain/value_objects/Availability.ts:37:22
     }
   }
 
-  toString(): string {
-    return (
-      `Open: ${this.openHour}:00 - Closes:${this.closeHour}:00` +
-      ` Waiting time: ${this.waitingTime} minutes`
-    );
-  }
+  toString(): string {}
 }
 

[NoCoverage] StringLiteral
store/domain/value_objects/Availability.ts:39:7
 
   toString(): string {
     return (
-      `Open: ${this.openHour}:00 - Closes:${this.closeHour}:00` +
+      `` +
       ` Waiting time: ${this.waitingTime} minutes`
     );

[NoCoverage] StringLiteral
store/domain/value_objects/Availability.ts:40:7
   toString(): string {
     return (
       `Open: ${this.openHour}:00 - Closes:${this.closeHour}:00` +
-      ` Waiting time: ${this.waitingTime} minutes`
+      ``
     );
   }
