[NoCoverage] BlockStatement
modules/owner/routes/OwnerRoutes.ts:13:23
   static createOwnerRoute: FastifyPluginAsync = async (
     fastify,
     _opts
-  ): Promise<void> => {
-    const ownerController = AppContainer.get<OwnerHttpController>(
-      OWNER_HTTP_CONTROLLER
-    );
-
-    const createRoute = FastifyRouteAdapter.create(ownerController);
-
-    fastify.post(CREATE_OWNER_ROUTE, createRoute);
-  };
+  ): Promise<void> => {};
 }
 
