[NoCoverage] BlockStatement
modules/shared/adapters/FastifyRouteAdapter.ts:8:45
 } from '@core/shared/presentation/contracts';
 
 export class FastifyRouteAdapter {
-  static create(controller: HttpController) {
-    return async (
-      request: FastifyRequest,
-      reply: FastifyReply
-    ): Promise<FastifyReply> => {
-      if (!controller?.create) {
-        return reply
-          .code(InternalServerError.statusCode)
-          .send(InternalServerError.data);
-      }
-
-      const response = await controller.create(request);
-
-      return reply.status(response.statusCode).send(response.data);
-    };
-  }
+  static create(controller: HttpController) {}
 
   static update(controller: HttpController) {

[NoCoverage] BlockStatement
modules/shared/adapters/FastifyRouteAdapter.ts:12:33
     return async (
       request: FastifyRequest,
       reply: FastifyReply
-    ): Promise<FastifyReply> => {
-      if (!controller?.create) {
-        return reply
-          .code(InternalServerError.statusCode)
-          .send(InternalServerError.data);
-      }
-
-      const response = await controller.create(request);
-
-      return reply.status(response.statusCode).send(response.data);
-    };
+    ): Promise<FastifyReply> => {};
   }
 

[NoCoverage] ConditionalExpression
modules/shared/adapters/FastifyRouteAdapter.ts:13:11
       request: FastifyRequest,
       reply: FastifyReply
     ): Promise<FastifyReply> => {
-      if (!controller?.create) {
+      if (true) {
         return reply
           .code(InternalServerError.statusCode)

[NoCoverage] BooleanLiteral
modules/shared/adapters/FastifyRouteAdapter.ts:13:11
       request: FastifyRequest,
       reply: FastifyReply
     ): Promise<FastifyReply> => {
-      if (!controller?.create) {
+      if (controller?.create) {
         return reply
           .code(InternalServerError.statusCode)

[NoCoverage] BlockStatement
modules/shared/adapters/FastifyRouteAdapter.ts:29:33
     return async (
       request: FastifyRequest,
       reply: FastifyReply
-    ): Promise<FastifyReply> => {
-      if (!controller?.update) {
-        return reply
-          .code(InternalServerError.statusCode)
-          .send(InternalServerError.data);
-      }
-
-      const response = await controller.update(request);
-
-      return reply.status(response.statusCode).send(response.data);
-    };
+    ): Promise<FastifyReply> => {};
   }
 

[NoCoverage] ConditionalExpression
modules/shared/adapters/FastifyRouteAdapter.ts:30:11
       request: FastifyRequest,
       reply: FastifyReply
     ): Promise<FastifyReply> => {
-      if (!controller?.update) {
+      if (false) {
         return reply
           .code(InternalServerError.statusCode)

[NoCoverage] ConditionalExpression
modules/shared/adapters/FastifyRouteAdapter.ts:30:11
       request: FastifyRequest,
       reply: FastifyReply
     ): Promise<FastifyReply> => {
-      if (!controller?.update) {
+      if (true) {
         return reply
           .code(InternalServerError.statusCode)

[NoCoverage] BlockStatement
modules/shared/adapters/FastifyRouteAdapter.ts:46:33
     return async (
       request: FastifyRequest,
       reply: FastifyReply
-    ): Promise<FastifyReply> => {
-      if (!controller?.delete) {
-        return reply
-          .code(InternalServerError.statusCode)
-          .send(InternalServerError.data);
-      }
-
-      const response = await controller.delete(request);
-
-      return reply.status(response.statusCode).send(response.data);
-    };
+    ): Promise<FastifyReply> => {};
   }
 

[NoCoverage] BooleanLiteral
modules/shared/adapters/FastifyRouteAdapter.ts:47:11
       request: FastifyRequest,
       reply: FastifyReply
     ): Promise<FastifyReply> => {
-      if (!controller?.delete) {
+      if (controller?.delete) {
         return reply
           .code(InternalServerError.statusCode)

[NoCoverage] ConditionalExpression
modules/shared/adapters/FastifyRouteAdapter.ts:47:11
       request: FastifyRequest,
       reply: FastifyReply
     ): Promise<FastifyReply> => {
-      if (!controller?.delete) {
+      if (true) {
         return reply
           .code(InternalServerError.statusCode)

[NoCoverage] BlockStatement
modules/shared/adapters/FastifyRouteAdapter.ts:63:33
     return async (
       request: FastifyRequest,
       reply: FastifyReply
-    ): Promise<FastifyReply> => {
-      if (!controller?.index) {
-        return reply
-          .code(InternalServerError.statusCode)
-          .send(InternalServerError.data);
-      }
-
-      const response = await controller.index(request);
-
-      return reply.status(response.statusCode).send(response.data);
-    };
+    ): Promise<FastifyReply> => {};
   }
 

[NoCoverage] ConditionalExpression
modules/shared/adapters/FastifyRouteAdapter.ts:64:11
       request: FastifyRequest,
       reply: FastifyReply
     ): Promise<FastifyReply> => {
-      if (!controller?.index) {
+      if (false) {
         return reply
           .code(InternalServerError.statusCode)

[NoCoverage] BlockStatement
modules/shared/adapters/FastifyRouteAdapter.ts:64:31
       request: FastifyRequest,
       reply: FastifyReply
     ): Promise<FastifyReply> => {
-      if (!controller?.index) {
-        return reply
-          .code(InternalServerError.statusCode)
-          .send(InternalServerError.data);
-      }
+      if (!controller?.index) {}
 
       const response = await controller.index(request);

[NoCoverage] BlockStatement
modules/shared/adapters/FastifyRouteAdapter.ts:80:33
     return async (
       request: FastifyRequest,
       reply: FastifyReply
-    ): Promise<FastifyReply> => {
-      if (!controller?.show) {
-        return reply
-          .code(InternalServerError.statusCode)
-          .send(InternalServerError.data);
-      }
-
-      const response = await controller.show(request);
-
-      return reply.status(response.statusCode).send(response.data);
-    };
+    ): Promise<FastifyReply> => {};
   }
 }

[NoCoverage] BooleanLiteral
modules/shared/adapters/FastifyRouteAdapter.ts:81:11
       request: FastifyRequest,
       reply: FastifyReply
     ): Promise<FastifyReply> => {
-      if (!controller?.show) {
+      if (controller?.show) {
         return reply
           .code(InternalServerError.statusCode)

[NoCoverage] ConditionalExpression
modules/shared/adapters/FastifyRouteAdapter.ts:81:11
       request: FastifyRequest,
       reply: FastifyReply
     ): Promise<FastifyReply> => {
-      if (!controller?.show) {
+      if (false) {
         return reply
           .code(InternalServerError.statusCode)
