[NoCoverage] BlockStatement
store/src/main/server.ts:14:21
 const app: FastifyPluginAsync<AppOptions> = async (
   fastify: FastifyInstance,
   opts: Partial<AutoloadPluginOptions>
-): Promise<void> => {
-  fastify.register(cors);
-
-  // Do not touch the following lines
-
-  // This loads all plugins defined in plugins
-  // those should be support plugins that are reused
-  // through your application
-  fastify.register(AutoLoad, {
-    dir: join(__dirname, 'infra/fastify/plugins'),
-    options: opts
-  });
-
-  // This loads all plugins defined in routes
-  // define your routes in one of these
-  fastify.register(AutoLoad, {
-    dir: join(__dirname, 'routes'),
-    options: opts
-  });
-};
+): Promise<void> => {};
 
 export default app;

[NoCoverage] ObjectLiteral
store/src/main/server.ts:22:30
   // This loads all plugins defined in plugins
   // those should be support plugins that are reused
   // through your application
-  fastify.register(AutoLoad, {
-    dir: join(__dirname, 'infra/fastify/plugins'),
-    options: opts
-  });
+  fastify.register(AutoLoad, {});
 
   // This loads all plugins defined in routes

[NoCoverage] ObjectLiteral
store/src/main/server.ts:29:30
 
   // This loads all plugins defined in routes
   // define your routes in one of these
-  fastify.register(AutoLoad, {
-    dir: join(__dirname, 'routes'),
-    options: opts
-  });
+  fastify.register(AutoLoad, {});
 };
 
