[Killed] ConditionalExpression
owner/config/constants/OwnerConstants.ts:2:3
 export const NAME_MAX_LENGTH: number = Number.parseInt(
-  process.env.OWNER_NAME_MAX_LENGTH || '150',
+  false,
   10
 );
killedBy: CreateOwnerService Success Cases should be possible to create an Owner with only name and Document
statusReason: name must be at most NaN characters

[Killed] ConditionalExpression
owner/config/constants/OwnerConstants.ts:2:3
 export const NAME_MAX_LENGTH: number = Number.parseInt(
-  process.env.OWNER_NAME_MAX_LENGTH || '150',
+  true,
   10
 );
killedBy: CreateOwnerService Success Cases should be possible to create an Owner with only name and Document
statusReason: name must be at most NaN characters
