[Survived] BlockStatement
owner/config/container/OwnerContainer.ts:41:45
 import { Exception } from '@core/shared/data/contracts/exceptions';
 
 export class OwnerContainer {
-  static bindTo(container: Container): void {
-    container.bind<CreateOwner>(CREATE_OWNER).to(CreateOwnerService);
-    container.bind<UpdateOwner>(UPDATE_OWNER).to(UpdateOwnerService);
-    container.bind<ShowOwner>(SHOW_OWNER).to(ShowOwnerService);
-    container.bind<EnableOwner>(ENABLE_OWNER).to(EnableOwnerService);
-    container.bind<DisableOwner>(DISABLE_OWNER).to(DisableOwnerService);
-
-    container
-      .bind<OwnerReadRepository>(OWNER_READ_REPOSITORY)
-      .to(FakeOwnerReadRepository);
-
-    container
-      .bind<OwnerWriteRepository>(OWNER_WRITE_REPOSITORY)
-      .to(FakeOwnerWriteRepository);
-
-    container
-      .bind<HttpController<OwnerViewModel | Exception>>(OWNER_HTTP_CONTROLLER)
-      .to(OwnerHttpControllerImplementation);
-  }
+  static bindTo(container: Container): void {}
 }
 
