[Killed] BlockStatement
owner/data/services/CreateOwnerService.ts:31:58
   async create({
     name,
     documentNumber
-  }: InputCreateOwnerDTO): Promise<OutputCreateOwnerDTO> {
-    const owner = OwnerFactory.create({
-      name,
-      documentNumber
-    });
-
-    const foundDocument = await this.ownerReadRepository.findByDocument(
-      owner.document
-    );
-
-    if (foundDocument) {
-      throw new DocumentAlreadyExistsException();
-    }
-
-    const repositoryOwner = await this.ownerWriteRepository.create(owner);
-
-    await this.ownerReadRepository.create(repositoryOwner);
-
-    return repositoryOwner;
-  }
+  }: InputCreateOwnerDTO): Promise<OutputCreateOwnerDTO> {}
 }
 
killedBy: CreateOwnerService Success Cases should be possible to create an Owner with only name and Document
statusReason: TypeError: Cannot read property 'document' of undefined

[Killed] ObjectLiteral
owner/data/services/CreateOwnerService.ts:32:39
     name,
     documentNumber
   }: InputCreateOwnerDTO): Promise<OutputCreateOwnerDTO> {
-    const owner = OwnerFactory.create({
-      name,
-      documentNumber
-    });
+    const owner = OwnerFactory.create({});
 
     const foundDocument = await this.ownerReadRepository.findByDocument(
killedBy: CreateOwnerService Success Cases should be possible to create an Owner with only name and Document
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] ConditionalExpression
owner/data/services/CreateOwnerService.ts:41:9
       owner.document
     );
 
-    if (foundDocument) {
+    if (true) {
       throw new DocumentAlreadyExistsException();
     }
killedBy: CreateOwnerService Success Cases should be possible to create an Owner with only name and Document
statusReason: Document already exits!
