[Killed] BlockStatement
owner/data/models/RepositoryOwnerModel.ts:9:53
   extends OwnerModel
   implements RepositoryProps
 {
-  constructor(props: Partial<RepositoryOwnerModel>) {
-    super(props, OwnerValidatorFactory.create());
-  }
+  constructor(props: Partial<RepositoryOwnerModel>) {}
 
   created_at!: Date;
killedBy: FakeOwnerReadRepository should be possible to create an Repository Owner
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor
