[Killed] BlockStatement
owner/data/services/UpdateOwnerService.ts:29:58
   async update({
     id,
     name
-  }: InputUpdateOwnerDTO): Promise<OutputUpdateOwnerDTO> {
-    const owner = await this.ownerReadRepository.findByID(id);
-
-    if (!owner) {
-      throw new IDDoesNotExistException();
-    }
-
-    const repositoryOwner = new RepositoryOwnerModel({
-      ...owner,
-      name
-    });
-
-    await this.ownerWriteRepository.update(repositoryOwner);
-
-    await this.ownerReadRepository.replace(repositoryOwner);
-
-    return repositoryOwner;
-  }
+  }: InputUpdateOwnerDTO): Promise<OutputUpdateOwnerDTO> {}
 }
 
killedBy: UpdateOwnerService Success Cases should be possible update an Owner's name
statusReason: Error: expect(received).toBeTruthy()

Received: undefined
