[Killed] ArrowFunction
sources/mocks/models/RepositoryOwnerModelMockFactory.ts:15:48
   documentNumber?: string;
 };
 
-export const RepositoryOwnerModelMockFactory = (opts?: MockOptions) =>
-  new RepositoryOwnerModel({
-    id: opts?.id || '1',
-    name: opts?.name || 'Test',
-    document: new DocumentModel(
-      {
-        type: DocumentType.CPF,
-        number: opts?.documentNumber || '12345678901'
-      },
-      DocumentValidatorFactory.create()
-    ),
-    created_at: new Date(),
-    updated_at: new Date(),
-    deleted_at: null,
-    validation: new Validation()
-  });
+export const RepositoryOwnerModelMockFactory = () => undefined;
 
killedBy: FakeOwnerReadRepository should be possible to create an Repository Owner
statusReason: TypeError: Cannot read property 'id' of undefined

[Killed] ObjectLiteral
sources/mocks/models/RepositoryOwnerModelMockFactory.ts:16:28
 };
 
 export const RepositoryOwnerModelMockFactory = (opts?: MockOptions) =>
-  new RepositoryOwnerModel({
-    id: opts?.id || '1',
-    name: opts?.name || 'Test',
-    document: new DocumentModel(
-      {
-        type: DocumentType.CPF,
-        number: opts?.documentNumber || '12345678901'
-      },
-      DocumentValidatorFactory.create()
-    ),
-    created_at: new Date(),
-    updated_at: new Date(),
-    deleted_at: null,
-    validation: new Validation()
-  });
+  new RepositoryOwnerModel({});
 
killedBy: FakeOwnerReadRepository should be possible to create an Repository Owner
statusReason: name is a required field, document.number is a required field

[Killed] ConditionalExpression
sources/mocks/models/RepositoryOwnerModelMockFactory.ts:17:9
 
 export const RepositoryOwnerModelMockFactory = (opts?: MockOptions) =>
   new RepositoryOwnerModel({
-    id: opts?.id || '1',
+    id: false,
     name: opts?.name || 'Test',
     document: new DocumentModel(
killedBy: FakeOwnerReadRepository should be possible to find an Owner by ID
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
sources/mocks/models/RepositoryOwnerModelMockFactory.ts:17:9
 
 export const RepositoryOwnerModelMockFactory = (opts?: MockOptions) =>
   new RepositoryOwnerModel({
-    id: opts?.id || '1',
+    id: true,
     name: opts?.name || 'Test',
     document: new DocumentModel(
killedBy: FakeOwnerReadRepository should be possible to find an Owner by ID
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
sources/mocks/models/RepositoryOwnerModelMockFactory.ts:18:11
 export const RepositoryOwnerModelMockFactory = (opts?: MockOptions) =>
   new RepositoryOwnerModel({
     id: opts?.id || '1',
-    name: opts?.name || 'Test',
+    name: false,
     document: new DocumentModel(
       {
killedBy: FakeOwnerWriteRepository should be possible to update an Repository Owner
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not false

[Killed] OptionalChaining
sources/mocks/models/RepositoryOwnerModelMockFactory.ts:18:11
 export const RepositoryOwnerModelMockFactory = (opts?: MockOptions) =>
   new RepositoryOwnerModel({
     id: opts?.id || '1',
-    name: opts?.name || 'Test',
+    name: opts.name || 'Test',
     document: new DocumentModel(
       {
killedBy: FakeOwnerWriteRepository should be possible to create an Repository Owner
statusReason: TypeError: Cannot read property 'name' of undefined

[Killed] ObjectLiteral
sources/mocks/models/RepositoryOwnerModelMockFactory.ts:20:7
     id: opts?.id || '1',
     name: opts?.name || 'Test',
     document: new DocumentModel(
-      {
-        type: DocumentType.CPF,
-        number: opts?.documentNumber || '12345678901'
-      },
+      {},
       DocumentValidatorFactory.create()
     ),
killedBy: FakeOwnerWriteRepository should be possible to create an Repository Owner
statusReason: type is a required field, number is a required field

[Killed] ConditionalExpression
sources/mocks/models/RepositoryOwnerModelMockFactory.ts:22:17
     document: new DocumentModel(
       {
         type: DocumentType.CPF,
-        number: opts?.documentNumber || '12345678901'
+        number: true
       },
       DocumentValidatorFactory.create()
killedBy: FakeOwnerReadRepository should be possible to create an Repository Owner
statusReason: document number has invalid characters, number must be at least 11 characters

[Killed] OptionalChaining
sources/mocks/models/RepositoryOwnerModelMockFactory.ts:22:17
     document: new DocumentModel(
       {
         type: DocumentType.CPF,
-        number: opts?.documentNumber || '12345678901'
+        number: opts.documentNumber || '12345678901'
       },
       DocumentValidatorFactory.create()
killedBy: FakeOwnerWriteRepository should be possible to create an Repository Owner
statusReason: TypeError: Cannot read property 'documentNumber' of undefined
