[Killed] BlockStatement
owner/domain/factories/OwnerFactory.ts:7:66
 import { OwnerValidatorFactory } from './OwnerValidatorFactory';
 
 export class OwnerFactory {
-  static create({ documentNumber, ...owner }: OwnerProps): Owner {
-    const document = DocumentFactory.create({
-      number: documentNumber
-    });
-
-    return new Owner({ ...owner, document }, OwnerValidatorFactory.create());
-  }
+  static create({ documentNumber, ...owner }: OwnerProps): Owner {}
 }
 
killedBy: CreateOwnerService Success Cases should be possible to create an Owner with only name and Document
statusReason: TypeError: Cannot read property 'document' of undefined
