[Killed] BlockStatement
owner/domain/factories/OwnerValidatorFactory.ts:6:37
 import { Validator } from '@core/shared/domain/contracts';
 
 export class OwnerValidatorFactory {
-  static create(): Validator<Owner> {
-    return new OwnerYupValidator();
-  }
+  static create(): Validator<Owner> {}
 }
 
killedBy: FakeOwnerWriteRepository should be possible to create an Repository Owner
statusReason: Owner Validator not available
