[Killed] ObjectLiteral
domain/validator/yup/OwnerYupValidator.ts:11:16
     try {
       yup
         .object()
-        .shape({
-          name: yup
-            .string()
-            .max(NAME_MAX_LENGTH)
-            .matches(
-              /^([a-zA-Z\s\W]+[^0-9!@#$%^&*()_+\-=\\[\]{};':"\\|,.<>\\/?])$/,
-              'name has invalid characters'
-            )
-            .required(),
-          document: yup.object({
-            number: yup
-              .string()
-              .matches(/^[0-9]*$/)
-              .length(11)
-              .required()
-          })
-        })
+        .shape({})
         .validateSync(
           {
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Name
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected
Resolved to value: {"document": {"number": "12345678901", "type": "CPF", "validation": {"errors": []}, "validator": {}}, "name": "", "validation": {"errors": []}, "validator": {}}

[Killed] Regex
domain/validator/yup/OwnerYupValidator.ts:16:15
             .string()
             .max(NAME_MAX_LENGTH)
             .matches(
-              /^([a-zA-Z\s\W]+[^0-9!@#$%^&*()_+\-=\\[\]{};':"\\|,.<>\\/?])$/,
+              /^([^a-zA-Z\s\W]+[^0-9!@#$%^&*()_+\-=\\[\]{};':"\\|,.<>\\/?])$/,
               'name has invalid characters'
             )
killedBy: FakeOwnerWriteRepository should be possible to create an Repository Owner
statusReason: name has invalid characters

[Survived] ObjectLiteral
domain/validator/yup/OwnerYupValidator.ts:20:32
               'name has invalid characters'
             )
             .required(),
-          document: yup.object({
-            number: yup
-              .string()
-              .matches(/^[0-9]*$/)
-              .length(11)
-              .required()
-          })
+          document: yup.object({})
         })
         .validateSync(

[Killed] Regex
domain/validator/yup/OwnerYupValidator.ts:23:24
           document: yup.object({
             number: yup
               .string()
-              .matches(/^[0-9]*$/)
+              .matches(/^[^0-9]*$/)
               .length(11)
               .required()
killedBy: UpdateOwnerService Success Cases should be possible update an Owner's name
statusReason: document.number must match the following: "/^[^0-9]*$/"

[Killed] BlockStatement
domain/validator/yup/OwnerYupValidator.ts:37:22
             abortEarly: false
           }
         );
-    } catch (errors) {
-      const e = errors as yup.ValidationError;
-      e.errors.forEach(error => {
-        entity.validation.addError({
-          context: 'owner',
-          message: error
-        });
-      });
-    }
+    } catch (errors) {}
   }
 }
killedBy: UpdateOwnerService Exception Cases should not be possible to update an Owner's name with more than 150 characters
statusReason: Error: expect(received).rejects.toHaveProperty()

Received promise resolved instead of rejected

[Killed] BlockStatement
domain/validator/yup/OwnerYupValidator.ts:39:33
         );
     } catch (errors) {
       const e = errors as yup.ValidationError;
-      e.errors.forEach(error => {
-        entity.validation.addError({
-          context: 'owner',
-          message: error
-        });
-      });
+      e.errors.forEach(error => {});
     }
   }
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Name
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected
Resolved to value: {"document": {"number": "12345678901", "type": "CPF", "validation": {"errors": []}, "validator": {}}, "name": "", "validation": {"errors": []}, "validator": {}}

[Killed] StringLiteral
domain/validator/yup/OwnerYupValidator.ts:41:20
       const e = errors as yup.ValidationError;
       e.errors.forEach(error => {
         entity.validation.addError({
-          context: 'owner',
+          context: "",
           message: error
         });
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Name
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "name has invalid characters, name is a required field"
Received value: ""
