[Survived] ObjectLiteral
constants/domain/value_objects/PhoneConstants.ts:1:31
-export const PhoneConstants = {
-  PHONE_NUMBER_LENGTH: 1,
-  COUNTRY_CODE_LENGTH: 2,
-  PREFIX_LENGTH: 2
-};
+export const PhoneConstants = {};
 
