[Killed] ObjectLiteral
config/constants/http/HttpConstants.ts:1:30
-export const HttpConstants = {
-  BAD_REQUEST: 400
-};
+export const HttpConstants = {};
 
killedBy: OwnerHttpControllerImplementation create should return an Http Response with status code 400 if Document is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500
