[Killed] BlockStatement
data/contracts/exceptions/DocumentAlreadyExistsException.ts:5:17
 import { Exception } from './Exception';
 
 export class DocumentAlreadyExistsException extends Exception {
-  constructor() {
-    super({
-      name: 'DocumentAlreadyExistsException',
-      message: 'Document already exits!',
-      statusCode: HttpConstants.BAD_REQUEST
-    });
-  }
+  constructor() {}
 }
 
killedBy: CreateOwnerService Exception Cases should not be possible to create an Owner with same Document
statusReason: Error: expect(received).rejects.toBeInstanceOf(expected)

Expected constructor: DocumentAlreadyExistsException
Received constructor: ReferenceError
