[Killed] BlockStatement
data/contracts/exceptions/IDDoesNotExistException.ts:5:17
 import { Exception } from './Exception';
 
 export class IDDoesNotExistException extends Exception {
-  constructor() {
-    super({
-      name: 'IDDoesNotExistException',
-      message: 'ID does not exist!',
-      statusCode: HttpConstants.BAD_REQUEST
-    });
-  }
+  constructor() {}
 }
 
killedBy: ShowOwnerService Exception Cases should not be possible to show an Owner with an invalid ID
statusReason: Error: expect(received).rejects.toBeInstanceOf(expected)

Expected constructor: IDDoesNotExistException
Received constructor: ReferenceError

[Survived] ObjectLiteral
data/contracts/exceptions/IDDoesNotExistException.ts:6:11
 
 export class IDDoesNotExistException extends Exception {
   constructor() {
-    super({
-      name: 'IDDoesNotExistException',
-      message: 'ID does not exist!',
-      statusCode: HttpConstants.BAD_REQUEST
-    });
+    super({});
   }
 }
