[Killed] BlockStatement
data/contracts/exceptions/ValidationException.ts:5:32
 import { Exception } from './Exception';
 
 export class ValidationException extends Exception {
-  constructor(message: string) {
-    super({
-      message,
-      name: 'ValidationException',
-      statusCode: HttpConstants.BAD_REQUEST
-    });
-  }
+  constructor(message: string) {}
 }
 
killedBy: OwnerHttpControllerImplementation create should return an Http Response with status code 400 if Document is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: undefined
