[Killed] BlockStatement
data/sources/validation/Validation.ts:9:31
 export class Validation {
   private errors: ValidationErrorProps[] = [];
 
-  public hasErrors(): boolean {
-    return this.errors.length > 0;
-  }
+  public hasErrors(): boolean {}
 
   public addError(error: ValidationErrorProps) {
killedBy: OwnerHttpControllerImplementation create should return an Http Response with status code 400 if Document is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] ConditionalExpression
data/sources/validation/Validation.ts:10:12
   private errors: ValidationErrorProps[] = [];
 
   public hasErrors(): boolean {
-    return this.errors.length > 0;
+    return false;
   }
 
killedBy: OwnerHttpControllerImplementation create should return an Http Response with status code 400 if Document is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] BlockStatement
data/sources/validation/Validation.ts:13:48
     return this.errors.length > 0;
   }
 
-  public addError(error: ValidationErrorProps) {
-    this.errors.push(error);
-  }
+  public addError(error: ValidationErrorProps) {}
 
   public messages(context?: string): string {
killedBy: OwnerHttpControllerImplementation create should return an Http Response with status code 400 if Document is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Killed] BlockStatement
data/sources/validation/Validation.ts:17:45
     this.errors.push(error);
   }
 
-  public messages(context?: string): string {
-    let message = '';
-
-    if (context) {
-      this.errors.forEach(error => {
-        if (error.context === context) {
-          message += `${error.message}, `;
-        }
-      });
-
-      return message.slice(0, message.length - 2);
-    }
-
-    this.errors.forEach(error => {
-      message += `${error.context}:${error.message}, `;
-    });
-
-    return message.slice(0, message.length - 2);
-  }
+  public messages(context?: string): string {}
 }
 
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Name
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "name has invalid characters, name is a required field"
Received value: ""

[Killed] StringLiteral
data/sources/validation/Validation.ts:18:19
   }
 
   public messages(context?: string): string {
-    let message = '';
+    let message = "Stryker was here!";
 
     if (context) {
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Name
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "name has invalid characters, name is a required field"
Received value: "Stryker was here!name has invalid characters, name is a required field"

[Killed] BlockStatement
data/sources/validation/Validation.ts:20:18
   public messages(context?: string): string {
     let message = '';
 
-    if (context) {
-      this.errors.forEach(error => {
-        if (error.context === context) {
-          message += `${error.message}, `;
-        }
-      });
-
-      return message.slice(0, message.length - 2);
-    }
+    if (context) {}
 
     this.errors.forEach(error => {
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Name
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "name has invalid characters, name is a required field"
Received value: "owner:name has invalid characters, owner:name is a required field"

[Killed] ConditionalExpression
data/sources/validation/Validation.ts:22:13
 
     if (context) {
       this.errors.forEach(error => {
-        if (error.context === context) {
+        if (true) {
           message += `${error.message}, `;
         }
killedBy: Validation should not show errors from different contexts
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "test error2"
Received string:        "test error, test error2"

[Killed] StringLiteral
data/sources/validation/Validation.ts:23:22
     if (context) {
       this.errors.forEach(error => {
         if (error.context === context) {
-          message += `${error.message}, `;
+          message += ``;
         }
       });
killedBy: CreateOwnerService Exception Cases should not be possible create an Owner with invalid Name
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "name has invalid characters, name is a required field"
Received value: ""
