[Killed] BlockStatement
shared/domain/entity/Entity.ts:9:17
 
   validation!: Validation;
 
-  constructor() {
-    this.validation = new Validation();
-  }
+  constructor() {}
 
   get id(): string {
killedBy: CreateOwnerService Success Cases should be possible to create an Owner with only name and Document
statusReason: TypeError: Cannot read property 'hasErrors' of undefined
