[Killed] BlockStatement
value_objects/document/factories/DocumentFactory.ts:7:54
 import { DocumentValidatorFactory } from './DocumentValidatorFactory';
 
 export class DocumentFactory {
-  static create({ number }: DocumentProps): Document {
-    if (number.length === 11) {
-      return new Document(
-        {
-          number,
-          type: DocumentType.CPF
-        },
-        DocumentValidatorFactory.create()
-      );
-    }
-
-    return new Document(
-      {
-        number,
-        type: DocumentType.CNPJ
-      },
-      DocumentValidatorFactory.create()
-    );
-  }
+  static create({ number }: DocumentProps): Document {}
 }
 
killedBy: OwnerHttpControllerImplementation create should return an Http Response with Owner View Model
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "John"
Received: "ValidationException"

[Survived] BlockStatement
value_objects/document/factories/DocumentFactory.ts:8:31
 
 export class DocumentFactory {
   static create({ number }: DocumentProps): Document {
-    if (number.length === 11) {
-      return new Document(
-        {
-          number,
-          type: DocumentType.CPF
-        },
-        DocumentValidatorFactory.create()
-      );
-    }
+    if (number.length === 11) {}
 
     return new Document(

[Survived] ConditionalExpression
value_objects/document/factories/DocumentFactory.ts:8:9
 
 export class DocumentFactory {
   static create({ number }: DocumentProps): Document {
-    if (number.length === 11) {
+    if (true) {
       return new Document(
         {
