[Killed] BlockStatement
value_objects/document/factories/DocumentValidatorFactory.ts:6:40
 import { DocumentYupValidator } from '../validator';
 
 export class DocumentValidatorFactory {
-  static create(): Validator<Document> {
-    return new DocumentYupValidator();
-  }
+  static create(): Validator<Document> {}
 }
 
killedBy: FakeOwnerWriteRepository should be possible to create an Repository Owner
statusReason: TypeError: Cannot read property 'validate' of undefined
