[Killed] ConditionalExpression
owner/domain/entities/Owner.ts:24:9
 
     this.validateOwner();
 
-    if (this.notification.hasErrors()) {
+    if (false) {
       throw new ValidationException(this.notification.messages('owner'));
     }
killedBy: #CreateOwnerUseCase Exception Cases should not be possible create an Owner with invalid Name
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected
Resolved to value: {"_id": "f2562c9f-0c34-4004-bfd5-f0a262acf07c", "document": {"number": "12345678901", "type": "CPF", "validation": {"errors": []}, "validator": {}}, "name": ""}

[Killed] ConditionalExpression
owner/domain/entities/Owner.ts:24:9
 
     this.validateOwner();
 
-    if (this.notification.hasErrors()) {
+    if (true) {
       throw new ValidationException(this.notification.messages('owner'));
     }
killedBy: #EnableOwnerUseCase Success Cases should be possible to enable an Owner with an valid ID
statusReason: Error: thrown: [ValidationException]

[Killed] StringLiteral
owner/domain/entities/Owner.ts:25:64
     this.validateOwner();
 
     if (this.notification.hasErrors()) {
-      throw new ValidationException(this.notification.messages('owner'));
+      throw new ValidationException(this.notification.messages(""));
     }
   }
killedBy: #Owner instantiate a new Owner without document
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "document.number is a required field, document.type is a required field"
Received message:   "owner:document.number is a required field, owner:document.type is a required field"

[Timeout] BlockStatement
owner/domain/entities/Owner.ts:29:27
     }
   }
 
-  private validateOwner() {
-    if (!this.#validator) {
-      throw new InvalidValidatorException('Owner Validator is invalid.');
-    }
-
-    this.#validator.validate(this);
-  }
+  private validateOwner() {}
 }
 

[Killed] ConditionalExpression
owner/domain/entities/Owner.ts:30:9
   }
 
   private validateOwner() {
-    if (!this.#validator) {
+    if (false) {
       throw new InvalidValidatorException('Owner Validator is invalid.');
     }
killedBy: #Owner instantiate a new Owner with no validator
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: InvalidValidatorException
Received constructor: TypeError

Received message: "Cannot read property 'validate' of undefined"

      103 |       }

[Killed] BlockStatement
owner/domain/entities/Owner.ts:30:27
   }
 
   private validateOwner() {
-    if (!this.#validator) {
-      throw new InvalidValidatorException('Owner Validator is invalid.');
-    }
+    if (!this.#validator) {}
 
     this.#validator.validate(this);
killedBy: #Owner instantiate a new Owner with no validator
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: InvalidValidatorException
Received constructor: TypeError

Received message: "Cannot read property 'validate' of undefined"

      103 |       }
