[Killed] Regex
owner/config/constants/OwnerConstants.ts:7:3
 );
 
 export const NAME_REGEX =
-  /^([a-zA-Z\s\W]+[^0-9!@#$%^&*()_+\-=\\[\]{};':"\\|,.<>\\/?])$/;
+  /^([a-zA-Z\s\W]+[^0-9!@#$%^&*()_+\-=\\[\]{};':"\\|,.<>\\/?])/;
 
killedBy: #OwnerDataBuilder create a Owner with invalid name
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] Regex
owner/config/constants/OwnerConstants.ts:7:3
 );
 
 export const NAME_REGEX =
-  /^([a-zA-Z\s\W]+[^0-9!@#$%^&*()_+\-=\\[\]{};':"\\|,.<>\\/?])$/;
+  /^([a-zA-Z\s\W][^0-9!@#$%^&*()_+\-=\\[\]{};':"\\|,.<>\\/?])$/;
 
killedBy: #FakeOwnerReadRepository create should be possible to create an Repository Owner
statusReason: name has invalid characters
