[Killed] ObjectLiteral
entities/repository-owner/factories/RepositoryOwnerFactory.ts:6:32
 
 export class RepositoryOwnerFactory {
   static create({ ...owner }: RepositoryOwnerProps): RepositoryOwner {
-    return new RepositoryOwner({
-      created_at: new Date(),
-      updated_at: new Date(),
-      deleted_at: undefined,
-      ...owner
-    });
+    return new RepositoryOwner({});
   }
 }
killedBy: #RepositoryOwnerFactory create a Repository Owner
statusReason: id is a required field, name is a required field, document.number is a required field, document.type is a required field
