[Killed] ObjectLiteral
sources/mocks/data-builder/OwnerDataBuilder.ts:14:7
 
   constructor() {
     this.#ownerData = new Owner(
-      {
-        id: uuid.v4(),
-        name: 'John',
-        document: DocumentFactory.create({ number: '12345678901' })
-      },
+      {},
       OwnerValidatorFactory.create()
     );
killedBy: #OwnerDataBuilder create a valid Owner
statusReason: id is a required field, name is a required field, document.number is a required field, document.type is a required field

[Killed] StringLiteral
sources/mocks/data-builder/OwnerDataBuilder.ts:32:28
   }
 
   invalidName(): OwnerDataBuilder {
-    this.#ownerData.name = 'N@m$%';
+    this.#ownerData.name = "";
     return this;
   }
killedBy: #OwnerYupValidator validate Owner with invalid name
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "name has invalid characters"
Received: "name has invalid characters, name is a required field"
