[Killed] StringLiteral
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:11:23
     this.#ownerData = {
       id: uuid.v4(),
       name: 'John',
-      documentNumber: '12345678901'
+      documentNumber: ""
     };
   }
killedBy: #OwnerFactory create a new Owner with valid name
statusReason: document number is required

[Killed] StringLiteral
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:34:45
   }
 
   withoutName(): OwnerPropsDataBuilder {
-    Reflect.deleteProperty(this.#ownerData, 'name');
+    Reflect.deleteProperty(this.#ownerData, "");
     return this;
   }
killedBy: #OwnerPropsDataBuilder create a OwnerProps without name
statusReason: Error: expect(received).not.toBeDefined()

Received: "John"

[Killed] StringLiteral
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:44:28
   }
 
   invalidName(): OwnerPropsDataBuilder {
-    this.#ownerData.name = 'K$%n4';
+    this.#ownerData.name = "";
     return this;
   }
killedBy: #CreateOwnerUseCase Exception Cases should not be possible create an Owner with invalid Name
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "name has invalid characters"
Received value: "name has invalid characters, name is a required field"

[Killed] StringLiteral
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:54:45
   }
 
   withoutDocumentNumber(): OwnerPropsDataBuilder {
-    Reflect.deleteProperty(this.#ownerData, 'documentNumber');
+    Reflect.deleteProperty(this.#ownerData, "");
     return this;
   }
killedBy: #OwnerFactory create a new Owner with no document number
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "document number is required"

Received function did not throw

[Killed] StringLiteral
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:59:38
   }
 
   invalidDocumentNumber(): OwnerPropsDataBuilder {
-    this.#ownerData.documentNumber = 'aaaaaaaaaaa';
+    this.#ownerData.documentNumber = "";
     return this;
   }
killedBy: #OwnerPropsDataBuilder create a OwnerProps with invalid document number
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] StringLiteral
sources/mocks/data-builder/OwnerPropsDataBuilder.ts:64:38
   }
 
   blankDocumentNumber(): OwnerPropsDataBuilder {
-    this.#ownerData.documentNumber = '';
+    this.#ownerData.documentNumber = "Stryker was here!";
     return this;
   }
killedBy: #OwnerPropsDataBuilder create a OwnerProps with blank document number
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: ""
Received: "Stryker was here!"
