[Killed] ObjectLiteral
sources/mocks/data-builder/RepositoryOwnerDataBuilder.ts:9:53
   #repositoryOwnerData: RepositoryOwner;
 
   constructor() {
-    this.#repositoryOwnerData = new RepositoryOwner({
-      id: uuid.v4(),
-      name: 'John',
-      document: DocumentFactory.create({ number: '12345678901' }),
-      created_at: new Date(),
-      updated_at: new Date(),
-      deleted_at: undefined
-    });
+    this.#repositoryOwnerData = new RepositoryOwner({});
   }
 
killedBy: #RepositoryOwnerObjectMother create a valid RepositoryOwner
statusReason: id is a required field, name is a required field, document.number is a required field, document.type is a required field
