[Survived] BlockStatement
owner/config/container/OwnerContainer.ts:39:45
 import { OwnerHttpController } from '@core/owner/presentation/contracts';
 
 export class OwnerContainer {
-  static bindTo(container: Container): void {
-    container.bind<CreateOwner>(CREATE_OWNER).to(CreateOwnerUseCase);
-    container.bind<UpdateOwner>(UPDATE_OWNER).to(UpdateOwnerUseCase);
-    container.bind<ShowOwner>(SHOW_OWNER).to(ShowOwnerUseCase);
-    container.bind<EnableOwner>(ENABLE_OWNER).to(EnableOwnerUseCase);
-    container.bind<DisableOwner>(DISABLE_OWNER).to(DisableOwnerUseCase);
-
-    container
-      .bind<OwnerReadRepository>(OWNER_READ_REPOSITORY)
-      .to(FakeOwnerReadRepository);
-
-    container
-      .bind<OwnerWriteRepository>(OWNER_WRITE_REPOSITORY)
-      .to(FakeOwnerWriteRepository);
-
-    container
-      .bind<OwnerHttpController>(OWNER_HTTP_CONTROLLER)
-      .to(OwnerHttpControllerImplementation);
-  }
+  static bindTo(container: Container): void {}
 }
 
