[Killed] ConditionalExpression
owner/data/usecases/CreateOwnerUseCase.ts:41:9
       owner.document
     );
 
-    if (foundDocument) {
+    if (false) {
       throw new DocumentAlreadyExistsException();
     }
killedBy: #CreateOwnerUseCase Exception Cases should not be possible to create an Owner with same Document
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected
Resolved to value: {"_id": "07d5b364-a2d2-43ed-ad0d-a64cae3fe751", "document": {"number": "12345678901", "type": "CPF", "validation": {"errors": []}, "validator": {}}, "name": "John"}

[Killed] BlockStatement
owner/data/usecases/CreateOwnerUseCase.ts:41:24
       owner.document
     );
 
-    if (foundDocument) {
-      throw new DocumentAlreadyExistsException();
-    }
+    if (foundDocument) {}
 
     const repositoryOwner = await this.ownerWriteRepository.create(owner);
killedBy: #CreateOwnerUseCase Exception Cases should not be possible to create an Owner with same Document
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected
Resolved to value: {"_id": "04853114-5cbd-4d54-b14f-9578574f5db0", "document": {"number": "12345678901", "type": "CPF", "validation": {"errors": []}, "validator": {}}, "name": "John"}
