[Killed] ConditionalExpression
owner/data/usecases/DisableOwnerUseCase.ts:28:9
   ) {}
 
   async disable({ id }: InputDisableOwnerDTO): Promise<boolean> {
-    if (!id) {
+    if (true) {
       throw new InvalidParameterException('id');
     }
killedBy: #DisableOwnerUseCase Success Cases should be possible to disable an Owner with an valid ID
statusReason: Parameter id is invalid!

[Killed] BooleanLiteral
owner/data/usecases/DisableOwnerUseCase.ts:28:9
   ) {}
 
   async disable({ id }: InputDisableOwnerDTO): Promise<boolean> {
-    if (!id) {
+    if (id) {
       throw new InvalidParameterException('id');
     }
killedBy: #DisableOwnerUseCase Success Cases should be possible to disable an Owner with an valid ID
statusReason: Parameter id is invalid!

[Killed] BooleanLiteral
owner/data/usecases/DisableOwnerUseCase.ts:34:9
 
     const owner = await this.ownerReadRepository.findByID(id);
 
-    if (!owner) {
+    if (owner) {
       throw new IDDoesNotExistException();
     }
killedBy: #DisableOwnerUseCase Success Cases should be possible to disable an Owner with an valid ID
statusReason: ID does not exist!

[Killed] ConditionalExpression
owner/data/usecases/DisableOwnerUseCase.ts:34:9
 
     const owner = await this.ownerReadRepository.findByID(id);
 
-    if (!owner) {
+    if (false) {
       throw new IDDoesNotExistException();
     }
killedBy: #DisableOwnerUseCase Exception Cases should not be possible to disable an Owner with an invalid ID
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected
Resolved to value: false
