[Killed] BooleanLiteral
owner/data/usecases/EnableOwnerUseCase.ts:28:9
   ) {}
 
   async enable({ id }: InputEnableOwnerDTO): Promise<boolean> {
-    if (!id) {
+    if (id) {
       throw new InvalidParameterException('id');
     }
killedBy: #EnableOwnerUseCase Success Cases should be possible to enable an Owner with an valid ID
statusReason: Parameter id is invalid!

[Killed] ConditionalExpression
owner/data/usecases/EnableOwnerUseCase.ts:28:9
   ) {}
 
   async enable({ id }: InputEnableOwnerDTO): Promise<boolean> {
-    if (!id) {
+    if (true) {
       throw new InvalidParameterException('id');
     }
killedBy: #EnableOwnerUseCase Success Cases should be possible to enable an Owner with an valid ID
statusReason: Parameter id is invalid!

[NoCoverage] StringLiteral
owner/data/usecases/EnableOwnerUseCase.ts:29:43
 
   async enable({ id }: InputEnableOwnerDTO): Promise<boolean> {
     if (!id) {
-      throw new InvalidParameterException('id');
+      throw new InvalidParameterException("");
     }
 

[Killed] ConditionalExpression
owner/data/usecases/EnableOwnerUseCase.ts:34:9
 
     const owner = await this.ownerReadRepository.findByID(id);
 
-    if (!owner) {
+    if (true) {
       throw new IDDoesNotExistException();
     }
killedBy: #EnableOwnerUseCase Success Cases should be possible to enable an Owner with an valid ID
statusReason: ID does not exist!
