[Killed] BooleanLiteral
owner/data/usecases/ShowOwnerUseCase.ts:18:9
   ) {}
 
   async show({ id }: InputShowOwnerDTO): Promise<OutputShowOwnerDTO> {
-    if (!id) {
+    if (id) {
       throw new InvalidParameterException('id');
     }
killedBy: #ShowOwnerUseCase Success Cases should be possible to show an Owner with an valid ID
statusReason: Parameter id is invalid!

[Killed] ConditionalExpression
owner/data/usecases/ShowOwnerUseCase.ts:18:9
   ) {}
 
   async show({ id }: InputShowOwnerDTO): Promise<OutputShowOwnerDTO> {
-    if (!id) {
+    if (true) {
       throw new InvalidParameterException('id');
     }
killedBy: #ShowOwnerUseCase Success Cases should be possible to show an Owner with an valid ID
statusReason: Parameter id is invalid!
