[Killed] BlockStatement
owner/data/usecases/UpdateOwnerUseCase.ts:34:17
   }: InputUpdateOwnerDTO): Promise<OutputUpdateOwnerDTO> {
     const owner = await this.ownerReadRepository.findByID(id);
 
-    if (!owner) {
-      throw new IDDoesNotExistException();
-    }
+    if (!owner) {}
 
     const repositoryOwner = new RepositoryOwner({
killedBy: #UpdateOwnerUseCase Exception Cases should not be possible to update an non-existing Owner
statusReason: Error: expect(received).rejects.toBeInstanceOf(expected)

Expected constructor: IDDoesNotExistException
Received constructor: ValidationException

[Killed] ObjectLiteral
owner/data/usecases/UpdateOwnerUseCase.ts:38:49
       throw new IDDoesNotExistException();
     }
 
-    const repositoryOwner = new RepositoryOwner({
-      ...owner,
-      name
-    });
+    const repositoryOwner = new RepositoryOwner({});
 
     await this.ownerWriteRepository.update(repositoryOwner);
killedBy: #UpdateOwnerUseCase Success Cases should be possible update an Owner's name
statusReason: id is a required field, name is a required field, document.number is a required field, document.type is a required field
