[Killed] ObjectLiteral
domain/validator/yup/OwnerYupValidator.ts:20:21
             .matches(NAME_REGEX, 'name has invalid characters')
             .required(),
           document: yup
-            .object({
-              number: yup
-                .string()
-                .matches(DOCUMENT_NUMBER_REGEX, 'document.number is invalid')
-                .length(11)
-                .required(),
-              type: yup
-                .string()
-                .oneOf(['CPF'], 'document.type must be CPF')
-                .required()
-            })
+            .object({})
             .required()
         })
killedBy: #Owner instantiate a new Owner without document
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "document.number is a required field, document.type is a required field"
Received message:   "document is a required field"

[Killed] ArrayDeclaration
domain/validator/yup/OwnerYupValidator.ts:28:24
                 .required(),
               type: yup
                 .string()
-                .oneOf(['CPF'], 'document.type must be CPF')
+                .oneOf([], 'document.type must be CPF')
                 .required()
             })
killedBy: #OwnerFactory create a new Owner with valid name
statusReason: document.type must be CPF

[Killed] StringLiteral
domain/validator/yup/OwnerYupValidator.ts:28:25
                 .required(),
               type: yup
                 .string()
-                .oneOf(['CPF'], 'document.type must be CPF')
+                .oneOf([""], 'document.type must be CPF')
                 .required()
             })
killedBy: #OwnerYupValidator validate valid Owner
statusReason: document.type must be CPF

[Killed] BooleanLiteral
domain/validator/yup/OwnerYupValidator.ts:40:25
             document: entity.document
           },
           {
-            abortEarly: false
+            abortEarly: true
           }
         );
killedBy: #OwnerYupValidator validate Owner with no document
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "document.number is a required field, document.type is a required field"
Received: "document.type is a required field"

[Killed] BlockStatement
domain/validator/yup/OwnerYupValidator.ts:43:22
             abortEarly: false
           }
         );
-    } catch (errors) {
-      const e = errors as yup.ValidationError;
-      e.errors.forEach(error => {
-        entity.notification.addError({
-          context: 'owner',
-          message: error
-        });
-      });
-    }
+    } catch (errors) {}
   }
 }
killedBy: #UpdateOwnerUseCase Exception Cases should not be possible to update an Owner's name with more than 150 characters
statusReason: Error: expect(received).rejects.toHaveProperty()

Received promise resolved instead of rejected

[Killed] BlockStatement
domain/validator/yup/OwnerYupValidator.ts:45:33
         );
     } catch (errors) {
       const e = errors as yup.ValidationError;
-      e.errors.forEach(error => {
-        entity.notification.addError({
-          context: 'owner',
-          message: error
-        });
-      });
+      e.errors.forEach(error => {});
     }
   }
killedBy: #OwnerYupValidator validate Owner with no id
statusReason: Error: expect(received).toBeTruthy()

Received: false
