[Killed] EqualityOperator
infra/repositories/fakes/FakeOwnerReadRepository.ts:32:9
   async enable(enableOwner: EnableOwnerDTO): Promise<boolean> {
     const existingOwnerIndex = this.findOwnerIndex(enableOwner.id);
 
-    if (existingOwnerIndex < 0) {
+    if (existingOwnerIndex <= 0) {
       return false;
     }
killedBy: #FakeOwnerReadRepository enable should return true if Owner is disabled
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] EqualityOperator
infra/repositories/fakes/FakeOwnerReadRepository.ts:32:9
   async enable(enableOwner: EnableOwnerDTO): Promise<boolean> {
     const existingOwnerIndex = this.findOwnerIndex(enableOwner.id);
 
-    if (existingOwnerIndex < 0) {
+    if (existingOwnerIndex >= 0) {
       return false;
     }
killedBy: #FakeOwnerReadRepository enable should return true if Owner is disabled
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
infra/repositories/fakes/FakeOwnerReadRepository.ts:33:14
     const existingOwnerIndex = this.findOwnerIndex(enableOwner.id);
 
     if (existingOwnerIndex < 0) {
-      return false;
+      return true;
     }
 
killedBy: #FakeOwnerReadRepository enable should return return false if Owner doesn't exist
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BlockStatement
infra/repositories/fakes/FakeOwnerReadRepository.ts:44:33
   async disable(disableOwner: DisableOwnerDTO): Promise<boolean> {
     const existingOwnerIndex = this.findOwnerIndex(disableOwner.id);
 
-    if (existingOwnerIndex < 0) {
-      return false;
-    }
+    if (existingOwnerIndex < 0) {}
 
     this.owners[existingOwnerIndex].deleted_at = new Date();
killedBy: #FakeOwnerReadRepository disable should return return false if Owner doesn't exist
statusReason: TypeError: Cannot set property 'deleted_at' of undefined

[Killed] ArrowFunction
infra/repositories/fakes/FakeOwnerReadRepository.ts:65:54
       DocumentValidatorFactory.create()
     );
 
-    const existingOwnerIndex = this.owners.findIndex(foundOwner =>
-      foundOwner.document.isEqual(documentCheck)
+    const existingOwnerIndex = this.owners.findIndex(() => undefined
     );
 
killedBy: #FakeOwnerReadRepository findByDocument should return an Repository Owner if Document exists
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] EqualityOperator
infra/repositories/fakes/FakeOwnerReadRepository.ts:73:48
   }
 
   private findOwnerIndex(id: string): number {
-    return this.owners.findIndex(foundOwner => foundOwner.id === id);
+    return this.owners.findIndex(foundOwner => foundOwner.id !== id);
   }
 }
killedBy: #UpdateOwnerUseCase Success Cases should be possible update an Owner's name
statusReason: ID does not exist!

[Killed] ConditionalExpression
infra/repositories/fakes/FakeOwnerReadRepository.ts:73:48
   }
 
   private findOwnerIndex(id: string): number {
-    return this.owners.findIndex(foundOwner => foundOwner.id === id);
+    return this.owners.findIndex(foundOwner => false);
   }
 }
killedBy: #FakeOwnerReadRepository replace should be possible to replace an Repository Owner
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Test 2"
Received: "John"
