[Killed] ConditionalExpression
infra/repositories/fakes/FakeOwnerWriteRepository.ts:21:9
   async update(owner: RepositoryOwner): Promise<boolean> {
     const existingOwnerIndex = this.findOwnerIndex(owner.id);
 
-    if (existingOwnerIndex < 0) {
+    if (true) {
       return false;
     }
killedBy: FakeOwnerWriteRepository should be possible to update an Repository Owner
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ObjectLiteral
infra/repositories/fakes/FakeOwnerWriteRepository.ts:25:59
       return false;
     }
 
-    this.owners[existingOwnerIndex] = new RepositoryOwner({ ...owner });
+    this.owners[existingOwnerIndex] = new RepositoryOwner({});
 
     return true;
killedBy: #UpdateOwnerUseCase Success Cases should be possible update an Owner's name
statusReason: id is a required field, name is a required field, document.number is a required field, document.type is a required field

[Killed] ConditionalExpression
infra/repositories/fakes/FakeOwnerWriteRepository.ts:45:9
   async disable(disableOwner: DisableOwnerDTO): Promise<boolean> {
     const existingOwnerIndex = this.findOwnerIndex(disableOwner.id);
 
-    if (existingOwnerIndex < 0) {
+    if (false) {
       return false;
     }
killedBy: #DisableOwnerUseCase Success Cases should be possible to disable an Owner with an valid ID
statusReason: TypeError: Cannot set property 'deleted_at' of undefined
