[Survived] StringLiteral
owner/presentation/presenters/OwnerPresenter.ts:12:36
 import { OwnerViewModel } from '../views';
 import { OutputUpdateOwnerDTO } from '../../domain/dtos/update-owner/OutputUpdateOwnerDTO';
 
-const kHttpResponseOk = Symbol.for('okResponse');
+const kHttpResponseOk = Symbol.for("");
 
 export class OwnerPresenter {
