[Survived] StringLiteral
data/contracts/exceptions/IDDoesNotExistException.ts:7:13
 export class IDDoesNotExistException extends Exception {
   constructor() {
     super({
-      name: 'IDDoesNotExistException',
+      name: "",
       message: 'ID does not exist!',
       statusCode: HttpConstants.BAD_REQUEST

[Survived] StringLiteral
data/contracts/exceptions/IDDoesNotExistException.ts:8:16
   constructor() {
     super({
       name: 'IDDoesNotExistException',
-      message: 'ID does not exist!',
+      message: "",
       statusCode: HttpConstants.BAD_REQUEST
     });
