[NoCoverage] StringLiteral
data/contracts/exceptions/InvalidParameterException.ts:7:13
 export class InvalidParameterException extends Exception {
   constructor(parameterName: string) {
     super({
-      name: 'InvalidParameterException',
+      name: "",
       message: `Parameter ${parameterName} is invalid!`,
       statusCode: HttpConstants.BAD_REQUEST
