[Survived] StringLiteral
data/contracts/exceptions/ValidationException.ts:8:13
   constructor(message: string) {
     super({
       message,
-      name: 'ValidationException',
+      name: "",
       statusCode: HttpConstants.BAD_REQUEST
     });
