[Killed] BlockStatement
shared/domain/entity/Entity.ts:21:22
     return this._id;
   }
 
-  set id(id: string) {
-    this._id = id;
-  }
+  set id(id: string) {}
 }
 
killedBy: #OwnerDataBuilder create a valid Owner
statusReason: id is a required field
