[Killed] ConditionalExpression
domain/errors/notification/Notification.ts:10:12
   private errors: NotificationErrorProps[] = [];
 
   public hasErrors(): boolean {
-    return this.errors.length > 0;
+    return true;
   }
 
killedBy: #OwnerDataBuilder create a valid Owner
statusReason: Error: thrown: [ValidationException]

[Killed] EqualityOperator
domain/errors/notification/Notification.ts:10:12
   private errors: NotificationErrorProps[] = [];
 
   public hasErrors(): boolean {
-    return this.errors.length > 0;
+    return this.errors.length <= 0;
   }
 
killedBy: #OwnerDataBuilder create a valid Owner
statusReason: Error: thrown: [ValidationException]

[Killed] BlockStatement
domain/errors/notification/Notification.ts:13:50
     return this.errors.length > 0;
   }
 
-  public addError(error: NotificationErrorProps) {
-    this.errors.push(error);
-  }
+  public addError(error: NotificationErrorProps) {}
 
   public messages(context?: string): string {
killedBy: #CreateOwnerUseCase Exception Cases should not be possible create an Owner with invalid Name
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected
Resolved to value: {"_id": "422aa991-6282-4500-8f4c-484d1219528a", "document": {"number": "12345678901", "type": "CPF", "validation": {"errors": []}, "validator": {}}, "name": ""}

[Killed] ConditionalExpression
domain/errors/notification/Notification.ts:20:9
   public messages(context?: string): string {
     let message = '';
 
-    if (context) {
+    if (true) {
       this.errors.forEach(error => {
         if (error.context === context) {
killedBy: Notification should show all errors from different contexts
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "test:test error, test2:test error2"
Received string:    ""

[Killed] ConditionalExpression
domain/errors/notification/Notification.ts:20:9
   public messages(context?: string): string {
     let message = '';
 
-    if (context) {
+    if (false) {
       this.errors.forEach(error => {
         if (error.context === context) {
killedBy: #UpdateOwnerUseCase Exception Cases should not be possible to update an Owner's name with more than 150 characters
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "name must be at most 150 characters"
Received value: "owner:name must be at most 150 characters"

[Killed] BlockStatement
domain/errors/notification/Notification.ts:21:36
     let message = '';
 
     if (context) {
-      this.errors.forEach(error => {
-        if (error.context === context) {
-          message += `${error.message}, `;
-        }
-      });
+      this.errors.forEach(error => {});
 
       return message.slice(0, message.length - 2);
killedBy: #UpdateOwnerUseCase Exception Cases should not be possible to update an Owner's name with more than 150 characters
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "name must be at most 150 characters"
Received value: ""

[Killed] BlockStatement
domain/errors/notification/Notification.ts:22:40
 
     if (context) {
       this.errors.forEach(error => {
-        if (error.context === context) {
-          message += `${error.message}, `;
-        }
+        if (error.context === context) {}
       });
 
killedBy: #Owner instantiate a new Owner without name
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "name is a required field"
Received message:   ""

[Killed] ConditionalExpression
domain/errors/notification/Notification.ts:22:13
 
     if (context) {
       this.errors.forEach(error => {
-        if (error.context === context) {
+        if (false) {
           message += `${error.message}, `;
         }
killedBy: #Owner instantiate a new Owner without name
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "name is a required field"
Received message:   ""

[Killed] ArithmeticOperator
domain/errors/notification/Notification.ts:27:31
         }
       });
 
-      return message.slice(0, message.length - 2);
+      return message.slice(0, message.length + 2);
     }
 
killedBy: #OwnerYupValidator validate Owner with no id
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "id is a required field"
Received: "id is a required field, "

[Killed] BlockStatement
domain/errors/notification/Notification.ts:30:34
       return message.slice(0, message.length - 2);
     }
 
-    this.errors.forEach(error => {
-      message += `${error.context}:${error.message}, `;
-    });
+    this.errors.forEach(error => {});
 
     return message.slice(0, message.length - 2);
killedBy: Notification should show all errors from different contexts
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "test:test error, test2:test error2"
Received string:    ""
