[NoCoverage] BlockStatement
shared/domain/value_objects/Address.ts:18:39
 
   zip_code!: string;
 
-  constructor(data: Partial<Address>) {
-    Object.assign(this, data);
-
-    this.validateAddress();
-  }
+  constructor(data: Partial<Address>) {}
 
   validateZipCode(): void {

[NoCoverage] BlockStatement
shared/domain/value_objects/Address.ts:24:27
     this.validateAddress();
   }
 
-  validateZipCode(): void {
-    const zipCodeLength = AddressConstants.ZIP_CODE_LENGTH;
-
-    if (!this.zip_code) {
-      throw new Error('Zip code must not be null!');
-    }
-
-    if (this.zip_code.length !== zipCodeLength) {
-      throw new Error('Invalid zip code');
-    }
-
-    if (!/^[0-9]+$/.test(this.zip_code)) {
-      throw new Error('Invalid zip code');
-    }
-  }
+  validateZipCode(): void {}
 
   validateAddress(): void {

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Address.ts:27:9
   validateZipCode(): void {
     const zipCodeLength = AddressConstants.ZIP_CODE_LENGTH;
 
-    if (!this.zip_code) {
+    if (true) {
       throw new Error('Zip code must not be null!');
     }

[NoCoverage] BlockStatement
shared/domain/value_objects/Address.ts:27:25
   validateZipCode(): void {
     const zipCodeLength = AddressConstants.ZIP_CODE_LENGTH;
 
-    if (!this.zip_code) {
-      throw new Error('Zip code must not be null!');
-    }
+    if (!this.zip_code) {}
 
     if (this.zip_code.length !== zipCodeLength) {

[NoCoverage] EqualityOperator
shared/domain/value_objects/Address.ts:31:9
       throw new Error('Zip code must not be null!');
     }
 
-    if (this.zip_code.length !== zipCodeLength) {
+    if (this.zip_code.length === zipCodeLength) {
       throw new Error('Invalid zip code');
     }

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Address.ts:31:9
       throw new Error('Zip code must not be null!');
     }
 
-    if (this.zip_code.length !== zipCodeLength) {
+    if (true) {
       throw new Error('Invalid zip code');
     }

[NoCoverage] StringLiteral
shared/domain/value_objects/Address.ts:32:23
     }
 
     if (this.zip_code.length !== zipCodeLength) {
-      throw new Error('Invalid zip code');
+      throw new Error("");
     }
 

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Address.ts:35:9
       throw new Error('Invalid zip code');
     }
 
-    if (!/^[0-9]+$/.test(this.zip_code)) {
+    if (true) {
       throw new Error('Invalid zip code');
     }

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Address.ts:35:9
       throw new Error('Invalid zip code');
     }
 
-    if (!/^[0-9]+$/.test(this.zip_code)) {
+    if (false) {
       throw new Error('Invalid zip code');
     }

[NoCoverage] StringLiteral
shared/domain/value_objects/Address.ts:36:23
     }
 
     if (!/^[0-9]+$/.test(this.zip_code)) {
-      throw new Error('Invalid zip code');
+      throw new Error("");
     }
   }

[NoCoverage] BlockStatement
shared/domain/value_objects/Address.ts:40:27
     }
   }
 
-  validateAddress(): void {
-    this.isFieldsNull();
-    this.validateZipCode();
-    this.validateFieldLengths();
-  }
+  validateAddress(): void {}
 
   isFieldsNull() {

[NoCoverage] BlockStatement
shared/domain/value_objects/Address.ts:46:18
     this.validateFieldLengths();
   }
 
-  isFieldsNull() {
-    if (!this.country) {
-      throw new Error('Country must not be null!');
-    }
-
-    if (!this.state) {
-      throw new Error('State must not be null!');
-    }
-
-    if (!this.city) {
-      throw new Error('City must not be null!');
-    }
-
-    if (!this.street) {
-      throw new Error('Street must not be null!');
-    }
-  }
+  isFieldsNull() {}
 
   validateFieldLengths(): void {

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Address.ts:47:9
   }
 
   isFieldsNull() {
-    if (!this.country) {
+    if (true) {
       throw new Error('Country must not be null!');
     }

[NoCoverage] BooleanLiteral
shared/domain/value_objects/Address.ts:47:9
   }
 
   isFieldsNull() {
-    if (!this.country) {
+    if (this.country) {
       throw new Error('Country must not be null!');
     }

[NoCoverage] BooleanLiteral
shared/domain/value_objects/Address.ts:51:9
       throw new Error('Country must not be null!');
     }
 
-    if (!this.state) {
+    if (this.state) {
       throw new Error('State must not be null!');
     }

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Address.ts:51:9
       throw new Error('Country must not be null!');
     }
 
-    if (!this.state) {
+    if (false) {
       throw new Error('State must not be null!');
     }

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Address.ts:55:9
       throw new Error('State must not be null!');
     }
 
-    if (!this.city) {
+    if (false) {
       throw new Error('City must not be null!');
     }

[NoCoverage] BlockStatement
shared/domain/value_objects/Address.ts:55:21
       throw new Error('State must not be null!');
     }
 
-    if (!this.city) {
-      throw new Error('City must not be null!');
-    }
+    if (!this.city) {}
 
     if (!this.street) {

[NoCoverage] StringLiteral
shared/domain/value_objects/Address.ts:56:23
     }
 
     if (!this.city) {
-      throw new Error('City must not be null!');
+      throw new Error("");
     }
 

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Address.ts:59:9
       throw new Error('City must not be null!');
     }
 
-    if (!this.street) {
+    if (false) {
       throw new Error('Street must not be null!');
     }

[NoCoverage] BooleanLiteral
shared/domain/value_objects/Address.ts:59:9
       throw new Error('City must not be null!');
     }
 
-    if (!this.street) {
+    if (this.street) {
       throw new Error('Street must not be null!');
     }

[NoCoverage] BlockStatement
shared/domain/value_objects/Address.ts:72:49
     const numberMaxValue = AddressConstants.NUMBER_MAX_VALUE;
     const numberMinValue = AddressConstants.NUMBER_MIN_VALUE;
 
-    if (this.country.length > countryMaxLength) {
-      throw new Error(
-        `Country must be less than ${countryMaxLength} characters!`
-      );
-    }
+    if (this.country.length > countryMaxLength) {}
 
     if (this.state.length > stateMaxLength) {

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Address.ts:72:9
     const numberMaxValue = AddressConstants.NUMBER_MAX_VALUE;
     const numberMinValue = AddressConstants.NUMBER_MIN_VALUE;
 
-    if (this.country.length > countryMaxLength) {
+    if (true) {
       throw new Error(
         `Country must be less than ${countryMaxLength} characters!`

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Address.ts:78:9
       );
     }
 
-    if (this.state.length > stateMaxLength) {
+    if (true) {
       throw new Error(`State must be less than ${stateMaxLength} characters!`);
     }

[NoCoverage] EqualityOperator
shared/domain/value_objects/Address.ts:78:9
       );
     }
 
-    if (this.state.length > stateMaxLength) {
+    if (this.state.length <= stateMaxLength) {
       throw new Error(`State must be less than ${stateMaxLength} characters!`);
     }

[NoCoverage] StringLiteral
shared/domain/value_objects/Address.ts:79:23
     }
 
     if (this.state.length > stateMaxLength) {
-      throw new Error(`State must be less than ${stateMaxLength} characters!`);
+      throw new Error(``);
     }
 

[NoCoverage] EqualityOperator
shared/domain/value_objects/Address.ts:82:9
       throw new Error(`State must be less than ${stateMaxLength} characters!`);
     }
 
-    if (this.city.length > cityMaxLength) {
+    if (this.city.length <= cityMaxLength) {
       throw new Error(`City must be less than ${cityMaxLength} characters!`);
     }

[NoCoverage] EqualityOperator
shared/domain/value_objects/Address.ts:82:9
       throw new Error(`State must be less than ${stateMaxLength} characters!`);
     }
 
-    if (this.city.length > cityMaxLength) {
+    if (this.city.length >= cityMaxLength) {
       throw new Error(`City must be less than ${cityMaxLength} characters!`);
     }

[NoCoverage] StringLiteral
shared/domain/value_objects/Address.ts:83:23
     }
 
     if (this.city.length > cityMaxLength) {
-      throw new Error(`City must be less than ${cityMaxLength} characters!`);
+      throw new Error(``);
     }
 

[NoCoverage] BlockStatement
shared/domain/value_objects/Address.ts:86:47
       throw new Error(`City must be less than ${cityMaxLength} characters!`);
     }
 
-    if (this.street.length > streetMaxLength) {
-      throw new Error(
-        `Street must be less than ${streetMaxLength} characters!`
-      );
-    }
+    if (this.street.length > streetMaxLength) {}
 
     if (this.number < numberMinValue && this.number > numberMaxValue) {

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Address.ts:86:9
       throw new Error(`City must be less than ${cityMaxLength} characters!`);
     }
 
-    if (this.street.length > streetMaxLength) {
+    if (true) {
       throw new Error(
         `Street must be less than ${streetMaxLength} characters!`

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Address.ts:92:9
       );
     }
 
-    if (this.number < numberMinValue && this.number > numberMaxValue) {
+    if (true) {
       throw new Error(
         `Number must be greater than ${numberMinValue}` +

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Address.ts:92:9
       );
     }
 
-    if (this.number < numberMinValue && this.number > numberMaxValue) {
+    if (true && this.number > numberMaxValue) {
       throw new Error(
         `Number must be greater than ${numberMinValue}` +

[NoCoverage] StringLiteral
shared/domain/value_objects/Address.ts:103:7
   public toBrazilString(): string {
     return (
       `${this.country}, ${this.state}, ${this.city}, ${this.street}` +
-      ` nº${this.number}, ${this.neighborhood} - CEP: ${this.zip_code}`
+      ``
     );
   }
