[NoCoverage] BlockStatement
shared/domain/value_objects/Image.ts:10:37
 
   imageUrl!: string;
 
-  constructor(data: Partial<Image>) {
-    Object.assign(this, data);
-
-    this.validateImage();
-  }
+  constructor(data: Partial<Image>) {}
 
   validateImage(): void {

[NoCoverage] BlockStatement
shared/domain/value_objects/Image.ts:16:25
     this.validateImage();
   }
 
-  validateImage(): void {
-    const maxFilenameLength = ImageConstants.MAX_FILENAME_LENGTH;
-    const maxFileSize = ImageConstants.MAX_FILE_SIZE_IN_MB;
-
-    if (!(this.fileName && this.imageUrl && this.fileSize)) {
-      throw new Error('Image values must not be null!');
-    }
-
-    if (this.fileName.length > maxFilenameLength) {
-      throw new Error(`File name must be less than 255 characters!`);
-    }
-
-    if (this.fileSize > maxFileSize) {
-      throw new Error(`File size must be less than ${maxFileSize} MB!`);
-    }
-  }
+  validateImage(): void {}
 }
 

[NoCoverage] BlockStatement
shared/domain/value_objects/Image.ts:20:61
     const maxFilenameLength = ImageConstants.MAX_FILENAME_LENGTH;
     const maxFileSize = ImageConstants.MAX_FILE_SIZE_IN_MB;
 
-    if (!(this.fileName && this.imageUrl && this.fileSize)) {
-      throw new Error('Image values must not be null!');
-    }
+    if (!(this.fileName && this.imageUrl && this.fileSize)) {}
 
     if (this.fileName.length > maxFilenameLength) {

[NoCoverage] LogicalOperator
shared/domain/value_objects/Image.ts:20:11
     const maxFilenameLength = ImageConstants.MAX_FILENAME_LENGTH;
     const maxFileSize = ImageConstants.MAX_FILE_SIZE_IN_MB;
 
-    if (!(this.fileName && this.imageUrl && this.fileSize)) {
+    if (!(this.fileName || this.imageUrl && this.fileSize)) {
       throw new Error('Image values must not be null!');
     }

[NoCoverage] EqualityOperator
shared/domain/value_objects/Image.ts:24:9
       throw new Error('Image values must not be null!');
     }
 
-    if (this.fileName.length > maxFilenameLength) {
+    if (this.fileName.length >= maxFilenameLength) {
       throw new Error(`File name must be less than 255 characters!`);
     }

[NoCoverage] BlockStatement
shared/domain/value_objects/Image.ts:24:51
       throw new Error('Image values must not be null!');
     }
 
-    if (this.fileName.length > maxFilenameLength) {
-      throw new Error(`File name must be less than 255 characters!`);
-    }
+    if (this.fileName.length > maxFilenameLength) {}
 
     if (this.fileSize > maxFileSize) {

[NoCoverage] StringLiteral
shared/domain/value_objects/Image.ts:25:23
     }
 
     if (this.fileName.length > maxFilenameLength) {
-      throw new Error(`File name must be less than 255 characters!`);
+      throw new Error(``);
     }
 

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Image.ts:28:9
       throw new Error(`File name must be less than 255 characters!`);
     }
 
-    if (this.fileSize > maxFileSize) {
+    if (true) {
       throw new Error(`File size must be less than ${maxFileSize} MB!`);
     }

[NoCoverage] EqualityOperator
shared/domain/value_objects/Image.ts:28:9
       throw new Error(`File name must be less than 255 characters!`);
     }
 
-    if (this.fileSize > maxFileSize) {
+    if (this.fileSize >= maxFileSize) {
       throw new Error(`File size must be less than ${maxFileSize} MB!`);
     }

[NoCoverage] StringLiteral
shared/domain/value_objects/Image.ts:29:23
     }
 
     if (this.fileSize > maxFileSize) {
-      throw new Error(`File size must be less than ${maxFileSize} MB!`);
+      throw new Error(``);
     }
   }
