[NoCoverage] BooleanLiteral
shared/domain/value_objects/Phone.ts:10:17
 
   number!: string;
 
-  is_verified = false;
+  is_verified = true;
 
   constructor(data: Partial<Phone>) {

[NoCoverage] BlockStatement
shared/domain/value_objects/Phone.ts:12:37
 
   is_verified = false;
 
-  constructor(data: Partial<Phone>) {
-    Object.assign(this, data);
-
-    this.validatePhone();
-  }
+  constructor(data: Partial<Phone>) {}
 
   validatePhone(): void {

[NoCoverage] BlockStatement
shared/domain/value_objects/Phone.ts:18:25
     this.validatePhone();
   }
 
-  validatePhone(): void {
-    if (!(this.country_code && this.prefix && this.number)) {
-      throw new Error('Phone values must not be null!');
-    }
-
-    this.validateCountryCode();
-    this.validatePhoneByCountryCode();
-  }
+  validatePhone(): void {}
 
   validateCountryCode(): void {

[NoCoverage] BooleanLiteral
shared/domain/value_objects/Phone.ts:19:9
   }
 
   validatePhone(): void {
-    if (!(this.country_code && this.prefix && this.number)) {
+    if (this.country_code && this.prefix && this.number) {
       throw new Error('Phone values must not be null!');
     }

[NoCoverage] BlockStatement
shared/domain/value_objects/Phone.ts:19:61
   }
 
   validatePhone(): void {
-    if (!(this.country_code && this.prefix && this.number)) {
-      throw new Error('Phone values must not be null!');
-    }
+    if (!(this.country_code && this.prefix && this.number)) {}
 
     this.validateCountryCode();

[NoCoverage] BlockStatement
shared/domain/value_objects/Phone.ts:27:31
     this.validatePhoneByCountryCode();
   }
 
-  validateCountryCode(): void {
-    const countryCodeLength = PhoneConstants.COUNTRY_CODE_LENGTH;
-
-    if (this.country_code.length !== countryCodeLength) {
-      throw new Error('Invalid country code');
-    }
-
-    if (!/^[0-9]+$/.test(this.country_code)) {
-      throw new Error('Invalid country code');
-    }
-
-    this.country_code = `+${this.country_code}`;
-  }
+  validateCountryCode(): void {}
 
   validatePhoneByCountryCode(): void {

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Phone.ts:30:9
   validateCountryCode(): void {
     const countryCodeLength = PhoneConstants.COUNTRY_CODE_LENGTH;
 
-    if (this.country_code.length !== countryCodeLength) {
+    if (true) {
       throw new Error('Invalid country code');
     }

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Phone.ts:30:9
   validateCountryCode(): void {
     const countryCodeLength = PhoneConstants.COUNTRY_CODE_LENGTH;
 
-    if (this.country_code.length !== countryCodeLength) {
+    if (false) {
       throw new Error('Invalid country code');
     }

[NoCoverage] BlockStatement
shared/domain/value_objects/Phone.ts:34:46
       throw new Error('Invalid country code');
     }
 
-    if (!/^[0-9]+$/.test(this.country_code)) {
-      throw new Error('Invalid country code');
-    }
+    if (!/^[0-9]+$/.test(this.country_code)) {}
 
     this.country_code = `+${this.country_code}`;

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Phone.ts:34:9
       throw new Error('Invalid country code');
     }
 
-    if (!/^[0-9]+$/.test(this.country_code)) {
+    if (true) {
       throw new Error('Invalid country code');
     }

[NoCoverage] BlockStatement
shared/domain/value_objects/Phone.ts:41:38
     this.country_code = `+${this.country_code}`;
   }
 
-  validatePhoneByCountryCode(): void {
-    // TODO Search for country codes and redo this validation
-    if (this.country_code === '+55') {
-      this.validateBrazilPhone();
-    }
-  }
+  validatePhoneByCountryCode(): void {}
 
   validateBrazilPhone(): boolean {

[NoCoverage] BlockStatement
shared/domain/value_objects/Phone.ts:43:38
 
   validatePhoneByCountryCode(): void {
     // TODO Search for country codes and redo this validation
-    if (this.country_code === '+55') {
-      this.validateBrazilPhone();
-    }
+    if (this.country_code === '+55') {}
   }
 

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Phone.ts:43:9
 
   validatePhoneByCountryCode(): void {
     // TODO Search for country codes and redo this validation
-    if (this.country_code === '+55') {
+    if (false) {
       this.validateBrazilPhone();
     }

[NoCoverage] EqualityOperator
shared/domain/value_objects/Phone.ts:52:9
     const phoneNumberLength = PhoneConstants.PHONE_NUMBER_LENGTH;
     const prefixLength = PhoneConstants.PREFIX_LENGTH;
 
-    if (this.prefix.length !== prefixLength) {
+    if (this.prefix.length === prefixLength) {
       throw new Error('Invalid phone prefix');
     }

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Phone.ts:52:9
     const phoneNumberLength = PhoneConstants.PHONE_NUMBER_LENGTH;
     const prefixLength = PhoneConstants.PREFIX_LENGTH;
 
-    if (this.prefix.length !== prefixLength) {
+    if (true) {
       throw new Error('Invalid phone prefix');
     }

[NoCoverage] BlockStatement
shared/domain/value_objects/Phone.ts:56:40
       throw new Error('Invalid phone prefix');
     }
 
-    if (!/^[0-9]+$/.test(this.prefix)) {
-      throw new Error('Invalid phone prefix');
-    }
+    if (!/^[0-9]+$/.test(this.prefix)) {}
 
     if (this.number.length !== phoneNumberLength) {

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Phone.ts:56:9
       throw new Error('Invalid phone prefix');
     }
 
-    if (!/^[0-9]+$/.test(this.prefix)) {
+    if (true) {
       throw new Error('Invalid phone prefix');
     }

[NoCoverage] EqualityOperator
shared/domain/value_objects/Phone.ts:60:9
       throw new Error('Invalid phone prefix');
     }
 
-    if (this.number.length !== phoneNumberLength) {
+    if (this.number.length === phoneNumberLength) {
       throw new Error('Invalid phone number');
     }

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Phone.ts:60:9
       throw new Error('Invalid phone prefix');
     }
 
-    if (this.number.length !== phoneNumberLength) {
+    if (true) {
       throw new Error('Invalid phone number');
     }

[NoCoverage] BlockStatement
shared/domain/value_objects/Phone.ts:64:40
       throw new Error('Invalid phone number');
     }
 
-    if (!/^[0-9]+$/.test(this.number)) {
-      throw new Error('Invalid phone number');
-    }
+    if (!/^[0-9]+$/.test(this.number)) {}
 
     return true;

[NoCoverage] ConditionalExpression
shared/domain/value_objects/Phone.ts:64:9
       throw new Error('Invalid phone number');
     }
 
-    if (!/^[0-9]+$/.test(this.number)) {
+    if (true) {
       throw new Error('Invalid phone number');
     }
