[Killed] BlockStatement
domain/value_objects/document/Document.ts:23:38
 
     this.validateDocument();
 
-    if (this.validation.hasErrors()) {
-      throw new ValidationException(this.validation.messages('document'));
-    }
+    if (this.validation.hasErrors()) {}
   }
 
killedBy: #CreateOwnerUseCase Exception Cases should not be possible create an Owner with invalid Document number
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "document number has invalid characters"
Received value: "document.number is invalid"

[Killed] ConditionalExpression
domain/value_objects/document/Document.ts:23:9
 
     this.validateDocument();
 
-    if (this.validation.hasErrors()) {
+    if (true) {
       throw new ValidationException(this.validation.messages('document'));
     }
killedBy: #OwnerDataBuilder create a valid Owner
statusReason: Error: thrown: [ValidationException]

[Killed] BlockStatement
domain/value_objects/document/Document.ts:28:36
     }
   }
 
-  private validateDocument(): void {
-    this.validator.validate(this);
-  }
+  private validateDocument(): void {}
 
   public static validateCPF(_cpf: string): boolean {
killedBy: #CreateOwnerUseCase Exception Cases should not be possible create an Owner with invalid Document number
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "document number has invalid characters"
Received value: "document.number is invalid"

[NoCoverage] BooleanLiteral
domain/value_objects/document/Document.ts:33:12
   }
 
   public static validateCPF(_cpf: string): boolean {
-    return true;
+    return false;
   }
 

[NoCoverage] BooleanLiteral
domain/value_objects/document/Document.ts:37:12
   }
 
   public static validateCNPJ(_cnpj: string): boolean {
-    return true;
+    return false;
   }
 

[Killed] ObjectLiteral
domain/value_objects/document/Document.ts:45:12
   }
 
   public getDocumentValues(): Partial<Document> {
-    return {
-      number: this.number,
-      type: this.type
-    };
+    return {};
   }
 
killedBy: #CreateOwnerUseCase Success Cases should be possible to create an Owner with only name and Document
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "12345678901"
Received: undefined

[Killed] ConditionalExpression
domain/value_objects/document/Document.ts:56:12
   }
 
   public isEqual(document: Document): boolean {
-    return this.toString() === document.toString();
+    return false;
   }
 }
killedBy: #FakeOwnerReadRepository findByDocument should return an Repository Owner if Document exists
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] EqualityOperator
domain/value_objects/document/Document.ts:56:12
   }
 
   public isEqual(document: Document): boolean {
-    return this.toString() === document.toString();
+    return this.toString() !== document.toString();
   }
 }
killedBy: #CreateOwnerUseCase Exception Cases should not be possible to create an Owner with same Document
statusReason: Error: expect(received).rejects.toBeInstanceOf()

Received promise resolved instead of rejected
Resolved to value: {"_id": "555ec0a6-a430-4e14-94ce-e82b9e247392", "document": {"number": "12345678901", "type": "CPF", "validation": {"errors": []}, "validator": {}}, "name": "John"}
