[Killed] ConditionalExpression
value_objects/document/factories/DocumentFactory.ts:9:9
 
 export class DocumentFactory {
   static create({ number }: DocumentProps): Document {
-    if (!number) {
+    if (false) {
       throw new ValidationException('document number is required');
     }
killedBy: #CreateOwnerUseCase Exception Cases should not be possible create an Owner with invalid Document number
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "document number is required"
Received value: "number must be at least 11 characters, number is a required field"

[Killed] ConditionalExpression
value_objects/document/factories/DocumentFactory.ts:9:9
 
 export class DocumentFactory {
   static create({ number }: DocumentProps): Document {
-    if (!number) {
+    if (true) {
       throw new ValidationException('document number is required');
     }
killedBy: #OwnerDataBuilder create a valid Owner
statusReason: document number is required

[Killed] StringLiteral
value_objects/document/factories/DocumentFactory.ts:10:37
 export class DocumentFactory {
   static create({ number }: DocumentProps): Document {
     if (!number) {
-      throw new ValidationException('document number is required');
+      throw new ValidationException("");
     }
 
killedBy: #CreateOwnerUseCase Exception Cases should not be possible create an Owner with invalid Document number
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "document number is required"
Received value: ""

[Killed] BlockStatement
value_objects/document/factories/DocumentFactory.ts:13:31
       throw new ValidationException('document number is required');
     }
 
-    if (number.length === 11) {
-      return new Document(
-        {
-          number,
-          type: DocumentType.CPF
-        },
-        DocumentValidatorFactory.create()
-      );
-    }
+    if (number.length === 11) {}
 
     return new Document(
killedBy: #CreateOwnerUseCase Success Cases should be possible to create an Owner with only name and Document
statusReason: document.type must be CPF

[Killed] EqualityOperator
value_objects/document/factories/DocumentFactory.ts:13:9
       throw new ValidationException('document number is required');
     }
 
-    if (number.length === 11) {
+    if (number.length !== 11) {
       return new Document(
         {
killedBy: #RepositoryOwnerFactory create a Repository Owner
statusReason: document.type must be CPF
