[Killed] BlockStatement
value_objects/document/validator/DocumentYupValidator.ts:8:9
 
 export class DocumentYupValidator implements Validator<Document> {
   public validate(entity: Document): void {
-    try {
-      yup
-        .object()
-        .shape({
-          type: yup
-            .string()
-            .oneOf([DocumentType.CPF, DocumentType.CNPJ])
-            .required(),
-          number: yup
-            .string()
-            .matches(/^[0-9]*$/, 'document number has invalid characters')
-            .min(11)
-            .max(14)
-            .required()
-        })
-        .validateSync(
-          {
-            type: entity.type,
-            number: entity.number
-          },
-          {
-            abortEarly: false
-          }
-        );
-    } catch (errors) {
+    try {} catch (errors) {
       const e = errors as yup.ValidationError;
       e.errors.forEach(error => {
killedBy: #CreateOwnerUseCase Exception Cases should not be possible create an Owner with invalid Document number
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "document number has invalid characters"
Received value: "document.number is invalid"

[Killed] ObjectLiteral
value_objects/document/validator/DocumentYupValidator.ts:11:16
     try {
       yup
         .object()
-        .shape({
-          type: yup
-            .string()
-            .oneOf([DocumentType.CPF, DocumentType.CNPJ])
-            .required(),
-          number: yup
-            .string()
-            .matches(/^[0-9]*$/, 'document number has invalid characters')
-            .min(11)
-            .max(14)
-            .required()
-        })
+        .shape({})
         .validateSync(
           {
killedBy: #CreateOwnerUseCase Exception Cases should not be possible create an Owner with invalid Document number
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "document number has invalid characters"
Received value: "document.number is invalid"

[Killed] Regex
value_objects/document/validator/DocumentYupValidator.ts:18:22
             .required(),
           number: yup
             .string()
-            .matches(/^[0-9]*$/, 'document number has invalid characters')
+            .matches(/^[0-9]$/, 'document number has invalid characters')
             .min(11)
             .max(14)
killedBy: #CreateOwnerUseCase Success Cases should be possible to create an Owner with only name and Document
statusReason: document number has invalid characters

[Killed] Regex
value_objects/document/validator/DocumentYupValidator.ts:18:22
             .required(),
           number: yup
             .string()
-            .matches(/^[0-9]*$/, 'document number has invalid characters')
+            .matches(/[0-9]*$/, 'document number has invalid characters')
             .min(11)
             .max(14)
killedBy: #CreateOwnerUseCase Exception Cases should not be possible create an Owner with invalid Document number
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "document number has invalid characters"
Received value: "document.number is invalid"

[Killed] BlockStatement
value_objects/document/validator/DocumentYupValidator.ts:32:22
             abortEarly: false
           }
         );
-    } catch (errors) {
-      const e = errors as yup.ValidationError;
-      e.errors.forEach(error => {
-        entity.validation.addError({
-          context: 'document',
-          message: error
-        });
-      });
-    }
+    } catch (errors) {}
   }
 }
killedBy: #CreateOwnerUseCase Exception Cases should not be possible create an Owner with invalid Document number
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "document number has invalid characters"
Received value: "document.number is invalid"

[Killed] BlockStatement
value_objects/document/validator/DocumentYupValidator.ts:34:33
         );
     } catch (errors) {
       const e = errors as yup.ValidationError;
-      e.errors.forEach(error => {
-        entity.validation.addError({
-          context: 'document',
-          message: error
-        });
-      });
+      e.errors.forEach(error => {});
     }
   }
killedBy: #CreateOwnerUseCase Exception Cases should not be possible create an Owner with invalid Document number
statusReason: Error: expect(received).rejects.toHaveProperty(path, value)

Expected path: "message"

Expected value: "document number has invalid characters"
Received value: "document.number is invalid"
