[Survived] StringLiteral
presentation/contracts/http/HttpResponse.ts:11:14
 export const InternalServerError: HttpResponse = {
   statusCode: 500,
   data: new Exception({
-    message: 'An internal error occurred, please try again!!',
+    message: "",
     name: 'Internal Server Error'
   })
