[NoCoverage] ConditionalExpression
src/main/config/env.ts:4:9
 import { EnvironmentConstants } from '@core/shared/config';
 
 export const env = {
-  port: process.env.PORT || EnvironmentConstants.PORT
+  port: false
 };
 

[NoCoverage] ConditionalExpression
src/main/config/env.ts:4:9
 import { EnvironmentConstants } from '@core/shared/config';
 
 export const env = {
-  port: process.env.PORT || EnvironmentConstants.PORT
+  port: true
 };
 
