[NoCoverage] BlockStatement
modules/owner/routes/OwnerRoutes.ts:16:23
   static createOwnerRoute: FastifyPluginAsync = async (
     fastify,
     _opts
-  ): Promise<void> => {
-    const createRoute = FastifyRouteAdapter.create(this.#ownerController);
-
-    fastify.post(CREATE_OWNER_ROUTE, createRoute);
-  };
+  ): Promise<void> => {};
 }
 
