[NoCoverage] OptionalChaining
modules/shared/adapters/FastifyRouteAdapter.ts:13:12
       request: FastifyRequest,
       reply: FastifyReply
     ): Promise<FastifyReply> => {
-      if (!controller?.create) {
+      if (!controller.create) {
         return reply
           .code(InternalServerError.statusCode)

[NoCoverage] BlockStatement
modules/shared/adapters/FastifyRouteAdapter.ts:25:45
     };
   }
 
-  static update(controller: HttpController) {
-    return async (
-      request: FastifyRequest,
-      reply: FastifyReply
-    ): Promise<FastifyReply> => {
-      if (!controller?.update) {
-        return reply
-          .code(InternalServerError.statusCode)
-          .send(InternalServerError.data);
-      }
-
-      const response = await controller.update(request);
-
-      return reply.status(response.statusCode).send(response.data);
-    };
-  }
+  static update(controller: HttpController) {}
 
   static delete(controller: HttpController) {

[NoCoverage] OptionalChaining
modules/shared/adapters/FastifyRouteAdapter.ts:30:12
       request: FastifyRequest,
       reply: FastifyReply
     ): Promise<FastifyReply> => {
-      if (!controller?.update) {
+      if (!controller.update) {
         return reply
           .code(InternalServerError.statusCode)

[NoCoverage] BlockStatement
modules/shared/adapters/FastifyRouteAdapter.ts:42:45
     };
   }
 
-  static delete(controller: HttpController) {
-    return async (
-      request: FastifyRequest,
-      reply: FastifyReply
-    ): Promise<FastifyReply> => {
-      if (!controller?.delete) {
-        return reply
-          .code(InternalServerError.statusCode)
-          .send(InternalServerError.data);
-      }
-
-      const response = await controller.delete(request);
-
-      return reply.status(response.statusCode).send(response.data);
-    };
-  }
+  static delete(controller: HttpController) {}
 
   static index(controller: HttpController) {

[NoCoverage] OptionalChaining
modules/shared/adapters/FastifyRouteAdapter.ts:47:12
       request: FastifyRequest,
       reply: FastifyReply
     ): Promise<FastifyReply> => {
-      if (!controller?.delete) {
+      if (!controller.delete) {
         return reply
           .code(InternalServerError.statusCode)

[NoCoverage] BlockStatement
modules/shared/adapters/FastifyRouteAdapter.ts:59:44
     };
   }
 
-  static index(controller: HttpController) {
-    return async (
-      request: FastifyRequest,
-      reply: FastifyReply
-    ): Promise<FastifyReply> => {
-      if (!controller?.index) {
-        return reply
-          .code(InternalServerError.statusCode)
-          .send(InternalServerError.data);
-      }
-
-      const response = await controller.index(request);
-
-      return reply.status(response.statusCode).send(response.data);
-    };
-  }
+  static index(controller: HttpController) {}
 
   static show(controller: HttpController) {

[NoCoverage] OptionalChaining
modules/shared/adapters/FastifyRouteAdapter.ts:64:12
       request: FastifyRequest,
       reply: FastifyReply
     ): Promise<FastifyReply> => {
-      if (!controller?.index) {
+      if (!controller.index) {
         return reply
           .code(InternalServerError.statusCode)

[NoCoverage] BlockStatement
modules/shared/adapters/FastifyRouteAdapter.ts:76:43
     };
   }
 
-  static show(controller: HttpController) {
-    return async (
-      request: FastifyRequest,
-      reply: FastifyReply
-    ): Promise<FastifyReply> => {
-      if (!controller?.show) {
-        return reply
-          .code(InternalServerError.statusCode)
-          .send(InternalServerError.data);
-      }
-
-      const response = await controller.show(request);
-
-      return reply.status(response.statusCode).send(response.data);
-    };
-  }
+  static show(controller: HttpController) {}
 }
 

[NoCoverage] OptionalChaining
modules/shared/adapters/FastifyRouteAdapter.ts:81:12
       request: FastifyRequest,
       reply: FastifyReply
     ): Promise<FastifyReply> => {
-      if (!controller?.show) {
+      if (!controller.show) {
         return reply
           .code(InternalServerError.statusCode)
