[NoCoverage] BlockStatement
store-service/src/main/server.ts:15:21
 const app: FastifyPluginAsync<AppOptions> = async (
   fastify: FastifyInstance,
   opts: Partial<AutoloadPluginOptions>
-): Promise<void> => {
-  // eslint-disable-next-line @typescript-eslint/no-unsafe-argument
-  fastify.register(cors);
-
-  // Do not touch the following lines
-
-  // This loads all plugins defined in plugins
-  // those should be support plugins that are reused
-  // through your application
-  fastify.register(AutoLoad, {
-    dir: join(__dirname, 'infra/fastify/plugins'),
-    options: opts
-  });
-
-  // This loads all plugins defined in routes
-  // define your routes in one of these
-  fastify.register(AutoLoad, {
-    dir: join(__dirname, 'routes'),
-    options: opts
-  });
-};
+): Promise<void> => {};
 
 export default app;

[NoCoverage] StringLiteral
store-service/src/main/server.ts:32:26
   // This loads all plugins defined in routes
   // define your routes in one of these
   fastify.register(AutoLoad, {
-    dir: join(__dirname, 'routes'),
+    dir: join(__dirname, ""),
     options: opts
   });
