[Killed] Regex
constants/domain/value_objects/DocumentConstants.ts:1:38
-export const DOCUMENT_NUMBER_REGEX = /^[0-9]*$/;
+export const DOCUMENT_NUMBER_REGEX = /[0-9]*$/;
 
killedBy: #OwnerYupValidator validate Owner with invalid document number
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] Regex
constants/domain/value_objects/DocumentConstants.ts:1:38
-export const DOCUMENT_NUMBER_REGEX = /^[0-9]*$/;
+export const DOCUMENT_NUMBER_REGEX = /^[0-9]$/;
 
killedBy: FakeOwnerWriteRepository should be possible to create an Repository Owner
statusReason: document.number is invalid
