[Killed] BlockStatement
shared/domain/value_objects/ValueObject.ts:7:17
 export abstract class ValueObject {
   validation!: Notification;
 
-  constructor() {
-    this.validation = new Notification();
-  }
+  constructor() {}
 }
 
killedBy: #OwnerDataBuilder create a valid Owner
statusReason: TypeError: Cannot read property 'hasErrors' of undefined
